{"title": "Cars 3 (2017)", "comments": ["Name: Cars 3  Release Date: 2017 Description: Mater Goes To McDonald's Restaurant To Order A Mater Burger For A Snack Before He Goes Home The Guy That Serves The Meal Says There Is None Left So Mater Comes Back Tommorow And He Finds The Evidence And He Gets The Mater Burger Then After He Goes Home Be Mysteriously Is Frozen And Then Lighting McQueen Arrives And Realizes That He's Frozen Then Goes To Get Help From Elsa In Arrendale To Unfreeze His Friends And Live A Normal Life", "Terrific family time! Nice homage to Doc Hudson, aka Paul Newman and racing legends. Very glad almost all of the original cast was back for this installment. Handles the tough topic of aging with grace and respect and the story has genuine heart. Hope our Cars friends keep coming back for many, many years!", "This was a great movie. Much better than the second one and very family oriented. Great for kids but also for parents. I would go see it again.", "More", "I need to see more trailers"]}
{"title": "Baby Driver", "comments": ["I can't say enough good things about this film. Saw it in April at an advanced screening, and seeing it twice more before official release day. Great action - all practical stunts, NO CGI!  Great music, that everything - and I do mean EVERYTHING - is perfectly choreographed to. Great jokes and zingers. Intensely stressful stakes. Stylistically beautiful. An action hero that does American Sign Language. If you like music at all, you'll appreciate this film so much. Do yourself a favor and see Baby Driver. It's endlessly fun, and the soundtrack will be in your head for weeks.", "Kept me with my eyes wide open the whole movie. One of the best movies I've seen in a really long time.", "", "Loved this movie!  Ansel Elgort was lovely in this movie.  The actor has a dance background, which was put to great use for a character who is constantly listening to music on an iPod and communicates through sign language to his foster parent.  There is a wonderful scene where he makes lunch for this dad in a choreographed sequence that reminded me of Gene Kelly waking up in the morning in AN AMERICAN IN PARIS.  There is another wonderful sequence when Elgort is walking down the street to get coffee while listening to his music. He skillfully and gracefully dodges obstacles, maneuvers around people and things, and engages with the environment in a dancing kind of way that matches this playlist.  The dance is handled as much by the camera and the environment as it is by Elgort--quite delightful.  And this whimsy amidst a story of terrible violence and murder, yet there is a great sense of humor laced throughout.  A fresh surprise!", "A movie all these critics like cannot be very good!! Director must have these critics in his pocket."]}
{"title": "Transformers: The Last Knight", "comments": ["This movie is so terribly written and stitched together that it becomes hysterical. The dialogue is so awkward and cringy. It's essentially 150 minutes of action sequences in slow motion or changing aspect ratios and poorly written exposition that makes no sense and is delivered with the grace, emotion, and talent of a Russian circus bear. The film is filled with Michael Bayisms that are painfully bad and impossible to escape. Throughout the movie I heard multiple people behind me saying how bad it was and three people next to me walked out. Now if you want to laugh at something for its shortcomings this is the movie for you, because there is a metric f**k ton of shortcomings in this movie and they are good for a laugh. But maybe wait until it's online. I go to sleep tonight after praying that Michael Bay disappears into his cocaine palace in Miami and never releases another film again, if you watch this movie you'll probably pray for that too.", "After 2-3 mediocre sequels this Transformers is finally summer blockbuster worthy: not the best but worth the Big screen.", "I'm blown away by this movie.", "Fantastic movie! Hope Michael Bay does at least 1 more.", "Dumb. Waste of time and money. I know people"]}
{"title": "47 Meters Down", "comments": ["This movie was really very interesting and thrilling! It takes you on an emotional roller coaster and I think diving aspect of this film is very realistic. They did a fine job.", "I was on the edge of my seat the whole time! I could not stay out of my dates lap! What a rush", "This movie was awful !!! I had such high expectations going into it & was really excited to see some sharks & how many did I see ? Like maybe 1 the whole time !! The girls were sooo whiny the whole movie not to mention the fact that spoiler you think they both survive & they don't !! Ending was terrible too much music very abrupt & I felt like it was maybe an hou long. Waste of my time, better to watch it when it comes on for free on On Demand (don't worry it won't be long)", "", "Don't! Just don't! Don't waste your time or money."]}
{"title": "Undercover Grandpa", "comments": []}
{"title": "Spider-Man: Homecoming", "comments": ["Spiderman Homecoming looks like it is going to be the best Spiderman movie of all time and not just that. It also looks like it will be one of the best Marvel movies too. I am so excited to see this movie! Just can't wait!", "", "", "Looks like it is going to be a good movie!", ""]}
{"title": "Swim Team", "comments": []}
{"title": "Our Time Will Come", "comments": []}
{"title": "Cartels", "comments": []}
{"title": "The Mummy (2017)", "comments": ["Please stop rating movies based on ads!!! Just be annoyed if you want but rate the movie based on the actual movie!!!!", "", "I love Tom Cruise and Russell Crowe, but Tom was miscast and Russell played Dr. Jekyl in a mummy movie. Enough said.", "What is portrayed in trailers as a legit mummy/horror movie is actually filled with lousy acting, meaningless humor and a confusing storyline.    I was terribly disappointed and felt duped.    Don't waste your precious money on this one, folks!", "I saw the movie, it was great. Do not know why people are rating a movie just by the ads they get"]}
{"title": "Santoalla", "comments": []}
{"title": "Wonder Woman", "comments": ["Took the family to a late showing on 6/1.  Waiting for this movie for years since Lynda Carter days.  Let me put it in bullet points as to easier to for my thought process. LOL  * Act 1 - They need to make it a little longer, 15-20 minutes was not enough about the Amazons, the place was beautiful and I wanted it more of little Diana, she was cute, adorable and feisty.  Wanted it more of the Queen and the Aunt, it moved rather quickly from there to the outside world.  * Act 2 - Very slow pace, was not boring but could use some of the time spent in Europe and use it for Themyscira, Steve Trevor's crew was ok, rather had the Amazons.  * Act 3 - Fight scenes leading up to the final fight, incredible!  Wonder Woman is a bad*** but at the same time, has a very caring heart.  The humor in this movie was on point and not forced.  Diana and Steve had such great chemistry.  What shocked me was the movie had a message at the end about humanity, walked out feeling good with a smile.", "It's hard to unseat Back to the Future but Wonder Woman is right there. This Movie gets everything about Wonder Woman right. As she discovers who she is and what she can do Gal Godot's performance is spot on in every nuance.. She goes from determination, to shock and awe, compassion, horror, dissapointment, anger, and finally Realization that while world may be compicated and have darkness in it, her role is to be a guiding light out of that darkness. Her growth to the fierce warrior, compasionate leader, loving princess, and gallant hero is as wonderful as anyone could have hoped it would be. Add in the awesome fight scenes, great spectacles of beauty, and realistic epic battles and you've got a movie for the ages.", "If you weren't a feminist before well, welcome. A must see for any all. Gal Gadot is perfection in this roll. A well balanced amount of action combined with a good story line and good acting and you've got yourself a worth film. Best DC Film I've seen to date. Very pleased, would pay to see it again.", "A very great movie I enjoyed it very much", "Going be epic awesome!!!!!"]}
{"title": "A Ghost Story", "comments": ["I'm looking forward to see this movie that's why I've given it five stars  but I am sad that it's only on limited release.  Fandango should make it clear it only opens in NY/LA", "All reviews I've read are positive, but this movie was hard to sit through. Listen to your instincts and consider leaving early to ask for a refund or switch theaters. If this was a free showing it might have been a better experience.   Casey Affleck lacks screen presence and looks better with clothes on, how about losing the beard? And If Rooney Mara is a good actress she was wasted in this film.  Please don't subject movie goers to this film."]}
{"title": "Les Pêcheurs de Perles Met Summer Encore", "comments": []}
{"title": "City of Ghosts (2017)", "comments": []}
{"title": "It Comes at Night", "comments": ["Seriously don't waste your time. Forreal, that was 2 hours I'll never get back. There was no plot, no climax, 150% no ending. I love movies I easily go one to two times a week and give just about everything a chance but that by far has got to be the worst movie I've seen all year. There was only 1 event to actually happen in the movie and it wasn't even explained. No details on how they came to where they are, how things started, nothing. No back story. No story in general. Super awful. See anything but that. If I could give 0 stars I would.", "This was the worst movie I have seen in a long time. There was nothing scary or suspenseful about this movie. Don't get lied to by other reviews into wasting your time or money into seeing this god-awful film. You will NOT be thrilled, you will NOT be scared, you won't even get a back story, monster, or anything but dream sequences and usual predictability. You may leave wondering what the point was of a couple of things and then get angry about those instances. Because why did you just waste your time in the first place when those 2 things don't matter anyway. You weren't scared and you never saw IT or anything remotely frightening. Just don't see this cuz you won't see it  or anything else at night. Ugh.", "I would never recommend this movie to anyone!!!", "The film receives one star from me because what was marketed to me and what I saw through the promotional images and misleading title was not what this film was about at all. If you want to see a Conjuring, or Ring film, this is NOT that. This film is brilliant, with its cinematic techniques, lightning, and set locations. It presents very good symbolic and special themes which are expressed very well if you can understand the message, and is a PSYCHOLOGICAL THRILLER, NOT a HORROR film. If you want to see a work of art instead of a blockbuster scarer go to this. Had I been advertised a family drama with horror elements and unease, I'd have given this 4.5-5 stars. But what this film marketed to me was not what it was at all. It's misleading. Don't watch if you want to actually be scared like a classic horror.", "How did Rotten Tomate give 86% to this movie????"]}
{"title": "Hearing Is Believing", "comments": []}
{"title": "Chi Va Chi Sau Ka", "comments": []}
{"title": "Pirates of the Caribbean: Dead Men Tell No Tales", "comments": ["Originally Written May 26, 2017-- Thrust into an all-new adventure, a down-on-his-luck Captain Jack Sparrow (Johnny Depp) and his first mate, Joshamee Gibbs (Kevin R. McNally), feel the winds of ill-fortune blowing even more strongly when deadly ghost sailors led by the evil Captain Salazar (Javier Bardem), escape from the Devil's Triangle. Their only hope for survival lies in seeking out the legendary Trident of Poseidon, but to find it, they must forge an uneasy alliance with a brilliant and beautiful astronomer (Kaya Scodelario) and a headstrong young man (Brenton Thwaites) attempting to escape the British navy.  In 2003, Disney embarked on a risky venture. They took the idea behind their famous theme park ride, Pirates of the Caribbean, and turned it into a film that many critics at the time thought would never work. Four films and some $3.7 billion later, that risky idea has turned into an incredibly massive franchise. While wildly entertaining, the last three films failed to capture the magic of that first adventure 14 years ago. But that has all changed with the newest entry in the series --- Dead Men Tell No Tales. I'm happy to report that this fifth film in the franchise has heart, humor, and rollicking adventure!  Depp is just as weird and wacky in his signature role as ever, McNally is wonderfully clever and crafty as his first mate, Bardem is equal parts charismatic and creepy as the cursed Capt. Salazar, and even Geoffrey Rush makes a triumphant appearance as Sparrow's arch-nemesis, Captain Hector Barbossa. But the real fun here lies with the two new leads, Scodelario's Carina Smyth and Thwaite's character. I could tell you who he is, but that would spoil one of the film's biggest surprises! Rest assured, the fun and magic of the original film is back. Two thumbs way, way up!", "As a mega fan of pirates I was excited to go for the first showing, sadly I was in for nothing but a let down. Jack has become a parody of himself, the one off characters were perplexing and ridiculous. I was so excited for the strong female character who demands to be taken seriously and holds science in such high regard, I wanted her scientific examination of the supernatural to prevail and hold the key to its undoing but no; scene after scene of horrible writing mixed with plot devices that strained at believability. All in all it was just disappointing.", "Fantastic!  Could be the 2nd best of the 5 films.  Salazar was spectacular. There was one point in the plot I thought was eh, but it went by quick and was worth it for the results.  Excellent movie and a ton of fun.", "All the real funny parts was already seen in the trailers. The movie felt rushed and stitched together in some parts. Areas felt short where they should have explained better, instead spent a great deal of time on things that was just tacked on. The first 3 was way better.", "It's 4 am on a Saturday, and I am still Hangry over last night.  I had eagerly awaited the return of my favorite swashbuckling pirate, Cap'n Jack Sparrow & the beloved crew of the Black Pearl, like one eagerly anticipates the succulent bite of the first steak of the summer grilling season, only to be served an under cooked tasteless meat like imitation of the T-Bone you were dreaming of.   Sure, it looked & smelled like a pirate movie, it had adventure and intrigue.  The main characters individual performances were strong, and compelling and the story line would have been good had it not attempted to package itself under the flagship colors of the Disney Pirates Of The Caribbean name.  I wanted to Love this Movie.  I wanted to have walked away from the theater, full and satisfied, knowing my time spent anticipating this movie was well worth the wait.  But I'm not, on so many levels I'm not.  Like a bad burger this movie left me asking the proverbial question, Where's the Beef?"]}
{"title": "National Theatre Live: Twelfth Night", "comments": []}
{"title": "The Freedom to Marry", "comments": ["Every once in a while, you see a doc that is better than a fiction film, which makes your heart race and your emotions soar. This is one of those rare movies. The weird thing is - you go in thinking you know this story, not expecting the surprises and the emotional power. But then the ride begins, and you fall in love with the characters on the screen and you realize youre on the edge of your seat... and cheering.", "This inspirational film shows the enormous difference individuals (like Evan Wolfson) can make, in this case in achieving marriage equality. Against the background of the landmark 2015 Supreme Court case, we see the importance of marriage in assuring stability to a family with 2 moms and 5 kids. Why should these children have fewer protections than children of male-female marriages? See it at Village Cinema East, this week.", "Great clear vision of why marriage can be so important and how we got that right for everyone in our great country", "", ""]}
{"title": "Saturday Night Fever 40th Anniversary", "comments": ["It was as good as it always was.  However, for the price of the ticket It was implied that they were offering more than just another viewing of the same movie.   Did I get the directors cut where they introduced new curse words I didnt hear in the original movie?  Did I get to hear the perspectives of the major players via interviews and analysis?  Nope.  I was unceremoniously kicked out of the theatre when the movie was over.  Save your money and stream it for $2.99...", "", "Awesome !!! ??"]}
{"title": "Jay Kill Presents: Funny Fridays", "comments": []}
{"title": "Finding Oscar", "comments": []}
{"title": "Chris Brown: Welcome To My Life", "comments": ["Chris didn't sugar coat anything. You may love him or have disdain for Chris Brown, but his rise and fall and rise again are worth seeing. It was a phenomenal movie.", "How anyone could put out trash like this is beyond me.  Then again I hear they're making Gnomio and Juliet II.  Don't waste your time, fan or his or not.  This is garbage.", "me being a huge fan of Chris Browns this movie was everything. I love how honest and open he was. No matter what you think of Chris Brown he is a talented individual and can do damn near everything!! seeing this movie just made me want to meet him even more! keep up the great work Chris. I'm proud of you!", "Wasn't crazy about it...  sorry expected to know more about his life, singing acting etc.", "I have LOVED CHRIS BROWN EVER Since the day his first song came out on the radio HE IS THE TRUE ?? THIS MOVIE WELCOME TO MY LIFE WAS TRULY AMAZING I LOVED EVERY MINUTE OF IT AND I CAN'T WAIT FOR HIS NEXT ALBUM HEARTBREAK ON A FULL MOON TO DROP I WISH THE BEST OF LUCK TO HIM FOR THE FUTURE I LOVE YOU CHRIS #CHRIS BROWN FAN 4LIFE."]}
{"title": "Spirit Game: Pride of a Nation", "comments": []}
{"title": "Samaritan’s Purse pres. Facing Darkness", "comments": ["Very thorough research and planning went into the making of this film.  The faith and integrity of the Samaritan's Purse Organization and Franklin Graham cannot be denied.  Dr. Brantley, too, is such a humble man of faith. Thank God for organizations like SP and Doctors Without Borders, who help so many hurting people, worldwide.", "Many times, a documentary is rather heavy on facts and lacks dramatic action but this film combined both in an engaging manner. What was even more amazing was that the drama was provided by the real people not actors. This film not only highlighted the bravery and dedication of the men and women of Samaritan’s Purse but also gave favorable attention to other partner organizations like Doctors without Borders, the CDIC, the Secretary of Health and Welfare, Emory Hospital and even the President of Liberia. In discussing the Ebola crisis, the cultural aspect of burial and touching added to the dramatic challenge as well as this happening in a crowed urban setting. If one negative would be noted it was the minimal attention paid to developing the antibody as well as the treatment in the hospital. However, to be fair this was not the primary focus of the makers of the movie. Great challenge at the end to recognize the need for holistic treatment which includes the spirit as well as the body.", "Very inspirational to see Christians being the hands and feet of Jesus and loving hurting people around the world, especially in Liberia when facing the darkness of Ebola.  Whole family loved it.  Makes me want to be a better Jesus follower.", "A movie of selfless people leading the way to care for people in West Africa during the Ebola crisis.  Inspiring!", "thats what Gods Love is All About"]}
{"title": "Muramba", "comments": []}
{"title": "Alive and Kicking (2017)", "comments": []}
{"title": "The Levelling", "comments": []}
{"title": "Some Like It Hot (1959) presented by TCM", "comments": ["Have loved this movie for decades but never viewed it on the big screen.  Didn't think I could find it even more enjoyable.", "This is one of the greatest movies ever made. Go see it!", "A classic film that never fails to bring a smile to my face! Jack Lemmon steals the show and Marilyn is absolutely gorgeous!", "", "Some like it hot is a hoot ! Performances by the entire cast , Impeccable, delightful.A classic comedy ."]}
{"title": "The Student (2017)", "comments": []}
{"title": "THE SCENT OF RAIN & LIGHTING", "comments": []}
{"title": "Heal the Living", "comments": []}
{"title": "Personal Shopper", "comments": ["There are several plot lines here, and it seems as though the director didn't quite know which one to go with. As a result, you get a lot of meandering within the movie.  I'm not much of a fan of Stewart's, because in my opinion, she has one default expression for every emotion. I suppose if you want to see an emo, sunken-eyed actress try to juggle several disjointed plots, you might enjoy this, but at the end of the day, there's not a lot of resolution to the story/stories, and you're left thinking Wait... that's the end??", "Personal Shopper is the kind of illiterate, pretentious film that leaves itself so open to interpretation that the story falls out.", "The movie was disjointed and weird.", "The plot went several different directions. I can usually make some sense of films. But what is even happening here? I dont know what we're supposed to be focused on. The only good part is watching Stewart who is easy to look at. She is a careless wreck. But her acting is on point. Too bad they couldn't finish the film.", "Walked out....did not hold my interest....confusing and unengaging."]}
{"title": "JOURNEY THROUGH FRENCH CINEMA", "comments": []}
{"title": "A Woman's Life", "comments": []}
{"title": "God of War", "comments": ["we must watch it as possible as i can", "Real martial arts, fine acting, good story and minimal/no green screen I could discern.", "Enjoyable action adventure with the Chinese army learning how to battle Japanese pirates. Battle scenes are sometimes graphic. Great ending sword fight to wrap-up movie.", "Excellent fantastic martial artists and clever plot. Beautifully filmed. Intricate set designs. Better than anything out there currently from Hollywood"]}
{"title": "The Transfiguration", "comments": ["Michael O'Shea’s THE TRANSFIGURATION is a quiet urban horror thriller that is mesmerizing. The narrative is an exceptional blending of the main character’s, Milo’s, tragedy and his search for an explanation of his place in the world within vampire lore. It is a slow burn that builds, drawing the viewer in, and delivers a devastating climax.  The film’s use of the vampire mythology reminds one of George Romero’s Martin or Tomas Alfredson’s Let the Right One In, while skillfully combing that with the urban landscapes and themes of New York City reminiscent of Spike Lee’s Do the Right Thing or Darren Aronofsky’s Requiem for a Dream.  CONTINUE READING AT FEARSmag.com - [BLOCKED WEBSITE]"]}
{"title": "The Last Shaman", "comments": []}
{"title": "One Week and a Day", "comments": ["a bit reminds of Japanese director Hirokazu Koreed. A bit slow but worth it,ending is warm."]}
{"title": "I Love You Both", "comments": []}
{"title": "DCI 2017 Tour Premiere", "comments": ["As an avid DCI fan, I love this opportunity to have a full stadium experience for an affordable price, and to be able to share the tour premiere with other wonderful fans without traveling all the way to Indianapolis. Keep showing these events, they're amazing!", "Great experience!  What a way to kick off DCI season! Loads of fun!!", "Horrible showing at my theatre. Picture was bigger than screen. They started 45min late. And last Corps the video went out!!!", "Totally awesome premiere. Can't wait to see how the shows evolve over the summer. Bluecoats had a great show!! They're going to be tough to beat! All the corps looked really good. It's going to be a great summer!"]}
{"title": "Bolshoi Ballet:  A Hero of our Time (2017)", "comments": ["New production of a new ballet by a classic company that completely delivers! Great choreography beautifully executed by transcendent principal dancers accompanied by the Bolshoi's legendary corps de ballet. Exquisite costumes and evocative sets complete an exceptional production."]}
{"title": "KATAMARAYUDU", "comments": ["", "Get ready to witness complete entertainer from Pawan Kalyan.", "", "Enti idi maaku ??????", ""]}
{"title": "Whisky Galore!", "comments": []}
{"title": "All These Sleepless Nights", "comments": []}
{"title": "Nise: The Heart of Madness", "comments": []}
{"title": "Bang! The Bert Berns Story", "comments": []}
{"title": "The Promise (2017)", "comments": ["I truly liked this film. I thought it really captured the character of the Armenian people. It did a good job including important historical content from the Armenian genocide in a 2 hour slot. It was well acted, informative and moving.   Finally a Hollywood film about the first genocide of the 20th century.   Turkey tries to depict themselves as a democratic nation but they are nothing but that. There is no true human rights in their country. Speak out and go to jail. Every Turkish writer who has voiced their opinion on the Turkish governments denial of the genocide has been imprisoned.  That is the level of  human rights they have in their country.   The Germans admitted their crimes against Jews long ago and they continue to apologize.  The Turkish government continues to deny their crimes of ethnic cleansing while they occupy and own 23 of Armenian lands they took through ethnic cleansing of their Christian population.   Thumps up for this movie.   Please go see it. Support freedom of soeach and awareness.   Thanks for reading", "Beautiful heart felt movie! First movie ever to make the big screen about the Armenian geneocide that took place over 100 years ago. First movie ever to donate 100 of all proceeds to non profit charities. A must see movie! Watch it opening weekend and know what everyone is and will be talking about!", "Amazing movie, so happy to have finally seen a movie regarding this dark chapter in human history. Oscar Isaac and the rest of the actors did amazing. Loved the cast.", "Great film", "Go and See it it's good."]}
{"title": "Royal Opera House: Madama Butterfly", "comments": []}
{"title": "Afterimage", "comments": []}
{"title": "Cézanne and I", "comments": ["I'm rating this poorly as I kept hoping it'd get better as it was filmed in my favorite place, Aix en Provence! I'd probably go again but I can't sit through film again. Not with complicated sentences too difficult to read quickly in either language. My date speaks French well and had a hard time!  But so pretty...Prettier than Aux is in the summer. It'd be nicer if Cezanne's actual parent's home had been shown! It's a gem! As are many Aix countryside areas plus the fountains!!! All of the fountains and ruins from the Romans and the Greeks!"]}
{"title": "Mimosas", "comments": []}
{"title": "Paint It Black", "comments": []}
{"title": "Frantz", "comments": ["I was really expecting that Adrien was Frantz's lover, and that story would have interested me, as a gay man. Once it was revealed that Adrien was not Frantz's lover, my interest kind of waned because I was disappointed. However, the writing, acting, and cinematography were splendid. This is a very good movie.", "SEE IT!!", "The movie is mostly in black and white. It gave me a sense of the pain and sorrows which burdened German families after the First World War. The parents in the film are inconsolable from the loss of their German son during the war. A strange French fellow shows up at the cemetery to show respect. He strikes up a friendship with the dead soldier's fiance. The woman follows the guy back to France. There are twists and turns as we learn the identity of the French man, and the attempt of the German woman to cope with grief and at the same time try not to fall in love with the French man. I enjoyed the movie's interesting take on post-war grief and the battle to move on with one's life.", "I give FRANTZ 5 stars.  Just when you think you know where it's going--you don't.  Unlike some other Ozon films--especially his earlier ones--FRANTZ is deep in message and meaning.  Loved it.", ""]}
{"title": "Chuck", "comments": ["Great movie, I lived through the Rocky years and never knew it was based on Chucks career. There were lots of twists and turns in his life, but all seem to have turned out for Chuck.  The biggest surprise was after the movie, the house lights came on and the Real Live Chuck walked down the aisle for a very live Q and A. We all took pictures with him and he is 65 tall, someone you can pick out of a crowd. Real nice guy, very opened and has lots more stories to tell. Chuck fought the best.  I recommend this pictures highly, be sure to see it.", "As real as it can get!!! Loved this movie! Liev does an awesome job!", "Great movie about importance of family and who your friends are vs. fleeting groupies and acquaintances.   When Chuck reaches his low points in life.. he reaches out to former love interest to restart his life.", "I have not seen the movie yet, but I am anxiously waiting to see it.  I am a huge Leiv Schreiber fan and hoping he will soon get the recognition he deserves.", "The actual events were much more entertaining than the film. An actual documentary would have told the story in a much better way."]}
{"title": "North by Northwest (1959) presented by TCM", "comments": ["", "The show was cancelled. Very disappointing.", "Alfred Hitchcock decides to ruin Cary Grant's day...", "", "I don't need to say how much I love this movie.  Seeing it with 45 degree lines running throughout the presentation, not a deal breaker but disappointed that one pays to see a great movie on the big screen and has to endure a less than optimal setup."]}
{"title": "A Beginner's Guide to Snuff", "comments": []}
{"title": "The Godfather (1972) presented by TCM", "comments": ["I never ever ever write reviews, but this movie is one of the greatest movies of all time.  Must see!  Bucket list type of thing.  Get opportunity to see it on the big screen is a pleasure.", "You can notice little things you never noticed before. Like an academy award on the movie director's nightstand in the morning before he wakes up.", "I will make this simple... If you have seen The Godfather and love it, seeing it on the big screen is a magical experience its a must! If you have never seen The Godfather, YOU NEED TO GO AND I ENVY YOU FOR WITNESSING THIS MOVIE FOR THE FIRST TIME ON THE BIG SCREEN! GO NOW!", "The Godfather is a movie that earned the praise and prestige over 45 years.", "This is a classic. An epic story of family and crime. The performances are outstanding from the lead roles by Al Pacino and Marlon Brando, to supporting roles by actors such as Alex Rocco, Abe Vigoda and John Cazale. The Baptism scene is one of the best ever filmed.  I've seen the movie on television and DVD many times, but seeing movies on a larger screen allows me to notice things I've missed before. Background  and characters  reactions are clearer.  See it in a theater if you have a chance."]}
{"title": "Buster's Mal Heart", "comments": []}
{"title": "Truman", "comments": ["It's a good story.  A man dying, his friend visits, and somehow the concentration is on the welfare of the sickly man's dog.  that was the problem I thought.  The friend flew all the way from the U.S. to Spain to be with him, and yet his friend didn't really have much to do, just tagging along at many occasions.  The son played somewhat a role.  But, in the end, it's a dog's show.", "This movie takes you through a range of emotions. Very well done. Drinking a beer right now to process all these after thoughts.", "This delightful movie is one of the best you'll see all year.  The reality of the words and actions -- pauses and silence are used to work wonders -- let you feel every emotion.  You're as torn as the cast facing the difficulty of making life and death decisions.  A bittersweet movie, to be sure, but so well acted.  You'll love it.", "This is the best movie this year.  A story of friendship and loss.  It was presented tenderly and with humor.  People who have experienced loss would totally understand the depth of this film.  Rotten Tomatoes has it right for sure, 100.", "Nuanced performances by the actors are bogged down by a mundane script. Story ends flat -- without hope or audience satisfaction. The dog ends up becoming more of the sentimental focus than the terminally Ill lead. It could have been much better."]}
{"title": "Stefan Zweig: Farewell to Europe", "comments": []}
{"title": "Queen of the Desert", "comments": []}
{"title": "Donald Cried", "comments": ["Danny Cried  is a wonderful film. Really hilarious and yet true to life. For those of us who left their home towns with little desire to revisit their past, there are many moments that will strike a deep nerve while the superb comedy and dialogue soothes and satisfies."]}
{"title": "Handsome Devil", "comments": []}
{"title": "Last Men in Aleppo", "comments": []}
{"title": "The Dinner (2017)", "comments": ["To make a movie this horrendous is almost an accomplishment.", "Shows how depraved and inhumane the rich  privileged people are.  No conscience except of all people the politician", "We walked out it was so bad. The story take a few twist and turns. After a very annoying coverage of old Gettysburg videos we decided to walk out. We heard from theater employees that they have given multiple refunds.", "Richard Gere is such a good actor that needs a hit movie. Sad to say but he is stuck in a flop with this movie. That's right another garbage movie. I have no idea how they can raise money to fund movies like this. I wish Richard could find a great movie and bring his career back to where it belongs.", "The worst thing about this movie is the annoying music. The story is a study of mental illness, family structure and politics. Not well written."]}
{"title": "Chonda Pierce: Enough", "comments": ["Must see", "I liked this movie better than her movie last year. It was great...I always have a smile on my face after seeing Chonda!! Love her??", "You laugh. You cry   You hope and you realized that you are enough!", "Funny, upifting film with a great ending song performance. If you aren't a Pierce fan, you wil be after this movie. And if you are, it is everything you would want.  Recommended!", "Chonda opens her heart, along with her close friends, and touches on subjects that many women/people can relate to today!  Thank you Chonda for your candor!  God Bless You!"]}
{"title": "Raising Bertie", "comments": ["I saw this film for the first time at its debut at Full Frame then again at the Gene Siskel in Chicago. It is beautifully shot and provides an empathetic glimpse of these young men's lives. While I loved it the first time I saw it, I couldn't believe how important it felt returning to this film and the prescient topics it brings up late last fall. I can't describe how moved to action I felt on seeing it again. Moving and incredible. Go see it if you can."]}
{"title": "ALL'OPERA: DIE ENTFUHRUNG AUS DEM SERAIL", "comments": []}
{"title": "My Entire High School Sinking Into the Sea", "comments": []}
{"title": "Glory (2017)", "comments": ["It was interesting seeing a stutterer gets rewarded for being honest.  So, the minister gave him a watch as reward.  It then went downhill from there.  We just didn't quite understand how it ended.  Walking out of the auditorium, we wondered, What happened?.  He stuttered too-oo-oo much, that's why?  Wow, the critics are 100% in praise of it.  We must be super unintelligent.  Perhaps, it's simply we don't speak the language.  In other words, we just don't stutter right."]}
{"title": "Table 19", "comments": ["It was pretty good overall. It was cute and funny to watch. Although it was hard to follow for a quick second it was cute though. Go watch it", "Really enjoyed this film. Have seen it twice! Great fresh and funny plot.", "Wonderful story and ensemble cast!! Loved it!", "Loved this movie. Funny moments and touching moments. Took a turn that was not expected- nice surprise. Great ending.", "This film is cute, funny, and surprisingly poignant. The entire cast is fantastic!"]}
{"title": "Slack Bay", "comments": []}
{"title": "Night School", "comments": []}
{"title": "Sacred", "comments": []}
{"title": "The Happiest Day in the Life of Olli Maki", "comments": ["Beautifully shot in black and white, performances so earnest that you will come to simply believe you are watching real people whose lives are unfolding on screen, Olli Maki is one of the greatest sports films ever made, and that might be because it goes to places rarely journeyed in that genre.  Do yourself a favor and do not miss this gem of a film!"]}
{"title": "The Wall (2017)", "comments": ["Unless I really missed something this is a movie about how an Iranian sniper that baited, played, and killed American soldiers and contractors....and who remained victorious right through the end of the movie.....I'm sure this movie will be a big hit with the  jihadist.   The American soldiers in this movie were portrayed as brave, courageous, and persevering.  Thank you for that aspect of the movie.    Thank you to all our servicemen and women for your sacrifices!!!", "This movie is such a disaster.  90 minutes of poor writing.  I thought it might be like Black Hawk Down, but this one is a snore.  No suspense.  Awful ending.  Maybe they ran out of money and said end it before people walk out.", "Horrible movie. Combine two Army Rangers and one pile of stones, throw in a disembodied voice and a whole heap of sand, and you have almost the entirety of the movie. The ending is even worse.", "This was an empty, hollow film with characters devoid of any redeeming attributes. The only slightly interesting component was listening to the Terrorist Sniper verbally twist the GI, portraying the evil of Radical Islamic Sociopaths.", "Worst movie I've ever seen and I see every movie that comes out for the most part. Don't waste your money seeing this horrible movie!!! It's not even worth a redbox rental fee! I wouldn't even watch this movie again if it was a free showing"]}
{"title": "I Called Him Morgan", "comments": ["There is some precious footage in this film, and what I appreciated most was that this wasn't some tawdry account of Lee Morgan's murder -- it told his story, and his common-law-wife's story as well, you got to hear him play, see his fellow musicians in action and hear what they had to say. He did have a serious drug problem, but he beat it, and there's emphasis on his work post-recovery, which is refreshing, no drama about his addiction. No one is trying to blow sunshine up anyone's skirt, you can see the toll it took on his face, but there isn't any lurid preoccupation or pandering to minds that aren't, uh, huge. It's an hour and a half long, and I felt like I had been sitting there for maybe half that time. Go!", "I was hoping the movie focused on Lee Morgan, the musician. That's what it did! Many musicians shared their perspectives on Mr Morgan. The story was told by his wife. Unfortunately the wife had two sides. I strongly recommend seeing the movie. This movie is educational for musicians and music lovers. It teaches us all about Lee Morgan (the trumpet player), good and not good relationships. Music lovers will appreciate it!", "This film is very well crafted. By using numerous rich and bold photos and intimate interviews, it tells a touching and important story of one of the worlds great artist who died way before his time. One experiences direct personal contact with Helen Morgan through her recorded voice that recounts her and Lee Morgan's perspectives with perfect detail. The editing is terrific. The pacing is well managed. The content is bountiful. The topic impressive. A life changing film.", "Don't do anything else in life until you figure out when you're going to see this movie!  It's that good.  And while I'm a jazz lover, there is so much more to the movie.  Here are the reasons why you should go:  (1) If you've lived in NC, Philly, NYC or South Jersey and you like seeing these places on the big screen or talked about in a movie. (2) If you love images of a city that is blanketed in fresh-fallen snow.  (3) If you love the richness of people recounting past events in a documentary style.  (4) If you know that jazz truly keeps the musicians looking young even when they're older.  (5) If you like the clothing and house stylings from the 1950s through the 70s.  (6) If you love it when someone beats a drug addiction.  (7) If you love seeing different types of large Afros from the 60s and 70s.  (8) If you love it when someone tells the truth about how Miles treated woman even if you know that he was brilliant musically.  (9) Finally, if you drool over this music called Jazz!"]}
{"title": "Hounds of Love", "comments": ["A straightforward, well-written and well-acted suspenseful, thriller.  Clever, believable enough.  3 stories intertwined that drive the movie.  Great twists that aren't fake.  Really enjoyed the psychology and suspense.  Tribeca and SXSW both had great reception!"]}
{"title": "Inversion", "comments": []}
{"title": "Buena Vista Social Club: Adios", "comments": ["This movie is phenomenal.  If you love music, you'll thank the gods for laying this all out in front of you.  And if you're a fan of the old-school documentary style, you'll feel right in your element.  Go see this!  Here are some very specific reasons for you to start moving in the direction of the movie theater right now.  1) If you love the ocean as a consistent back drop in a movie.  2) If you think that island cultures and people can be very interesting.  3) If you love learning more about the full history of the Americas.  4) If you know that true history goes way beyond wars and deep into the music and culture of everyday people.  5) If you think it's cool for people who are beyond 70 yrs old to be in the prime of their lives.  6) If you'd like to see a quiet, loving relationship develop between two older people without all the youth-oriented, mass culture focus on sex.  7) And once again, if you love to hear great music that makes you bop right in your seat.  Enjoy this movie!", "Terrific documentary! It touched my heart! It actually made me cry!  Having been to Cuba recently, i especially enjoyed it! Thank you for keeping this music alive and well.  You have made musical and documental history!", "Such a great film. Makes you sing dance and cry all at once!!", "It was very enjoyable and a great movie."]}
{"title": "ADVENTURES OF OMANAKUTTAN", "comments": []}
{"title": "NT Live: Who's Afraid of Virginia Woolf?", "comments": []}
{"title": "Harold and Lillian: A Hollywood Love Story", "comments": ["Such a great film! Don't miss it!  Unfortunately most Hollywood marriages don't have such a great ending as this one has!", "I found the film to interesting and entertaining.  H and L were an adorable couple and super talented ! Film lovers will appreciate the history in this film."]}
{"title": "Ramante Edanthottam", "comments": []}
{"title": "Champion (2017)", "comments": ["Champion is a movie that leaves you feeling like a different person when you walk out of the theater. This movie is a must see for the whole family.", "Excellent; must see! Deals with issues of today but shows the solution. Has some unexpected and turns throughout which intertwine. Would be suitable for older elementary age; younger ones may not understand some situations. Scenery is beautiful! Will see again!", "Great film and message.", "I cried. I laughed. I went home feeling so happy. A GREAT inspiring, life changing film.", "I am not sure I can put into words how impactful and inspiring this film was to me and the group who saw it with me. Forgiveness is something we each face in our lives and the challenges are life long. This movie is a must see because it helps us chase forgiveness even when it is running away because we may not feel strong enough to give it or worthy enough to receive it. Powerful story and perfect for the entire family. My favorite line from the film was: When you forgive you may not change your past but you will change your future."]}
{"title": "Before I Fall", "comments": ["I read the book and have been waiting patiently for this to come out! I really liked the movie, but I feel that they could have added more detail from the book about the characters. The book was a longer read, so I can understand they probably couldn't fit everything in. I laughed, I cried(a few times!) and overall was happy with how the movie turned out.", "I was surprised by how good this film was. I thought it would be GROUNDHOG DAY all over again. However I was wrong and it is a wonderful movie. It deals with bullying and the effect it has on people. It also looks at why people are bullies and what it takes for them to finally realize the pain and consquincoes they are causing others. The acting is fine by the entire cast. The director and screenplay writer both did a excellent job bring this film to the big screen. I highly recommend this film because of the message that it brings to the audience.", "im a mom and took my 14 year old daughter to see it. It was the typical teen drama story. Popular girls against the unpopular. The main character was the only decent actor.", "Well written. I cried a lot.", "I loved the book and the movie was just as good"]}
{"title": "Risk", "comments": ["For most of this purported documentary I wondered why Laura Poitras made this movie. It seemed thin & without focus. Her journal comments seemed petulant as if Assange had hurt her feelings. Then her climax relies on unsubstantiated accusations of sexual misconduct that did not result in charges being filed. There were so many avenues she could have explored, but instead she uses innuendo & rumor as if gossipy allegations of a sexual nature trump the video footage of murder by the US government shown early in the film. Objectivity was not her purpose. For all of Assange’s personal faults (none of which are substantiated here) she does not seem to appreciate the actual work of Wikileaks as it reflects the brutality of governmental totalitarian actions. This movie when one applies principles of journalistic integrity proves more damning of Poitras than Assange.", "", "Most of the material in this documentary? we've read of/seen in the papers really.  We just didn't read of the Applebaum side show, which was worth about 2 minutes.  Laura Poitras' side comments we couldn't seen to follow.  Nothing seemed to have been added with her words.  Wasted talent on her part?  More important  - wasted $ and time on our part."]}
{"title": "After the Storm (2017)", "comments": []}
{"title": "Le Trou", "comments": []}
{"title": "NT Live: Obsession", "comments": ["Everything about this exquisite production screams PERFECTION! Beautifully written, perfect cast, nuanced direction, intense performances, imaginative sets; live theatre performances just don't get any better than this. BRAVO!!", "The movie was cancelled and we weren't even informed. Took off from work to make it, drove all the way and wasted my time.", "The production was well staged, director Van Hove had some creative ideas within the minimalist presentation. Not everything worked for me but I still appreciated it. The minimalist approach certainly allowed Law and Halina Reijn more freedom to inhabit the roles and physically express their ever-changing emotions throughout the story. Both actors, especially Law, were fully capable of taking over the space. However, I thought the intimacy of this piece was dwarfed by such a large stage, which would probably be more noticeable had I watched it in person, instead of via a live feed. The play itself I felt was a bit underwritten, with many ancillary characters being underdeveloped and not making much sense or just being plain unnecessary within the story of these two doomed lovers. But Law's trademark electricity and passion held it together. The only real disappointment was the visual quality of the feed (not HD in this day and age?) and the distracting out of sync sound."]}
{"title": "Da Co Hoai Lang - Hello Vietnam", "comments": []}
{"title": "Dead Awake (2017)", "comments": ["Stunning", "So this movie was okay, wasn't scary however a decent view. Pretty good scene cuts and not too much suspense and slow moving parts."]}
{"title": "My Neighbor Totoro – Studio Ghibli Fest 2017", "comments": ["Will never get tired of watching this movie", "What more can be said about MY NEIGHBOR TOTORO?  Go see this movie.  Immediately.  Easily one of the best animated films ever made, Japanese or otherwise, it's a beautifully drawn, heart-tugging story about two sisters and their encounter with a mysterious forest spirit.  For a film made in 1988, it holds up extremely well.  The print quality at the screening I went to was beautiful, clean and devoid of film scratches.  While some people may miss the FOX English dub, the replacement by Disney, featuring Dakota and Elle Fanning as the two sisters, is more than acceptable.  Both perform their roles very well and the supporting cast does fine, too.  Only nitpicks:  occasional mistimed lines, OP song is a bit too gungho, and a few underacted moments, but otherwise a solid dub.  The audience for the most part (save for three people) really seemed to enjoy the movie, chuckling at the funny moments and applauding at the end.  Highly recommended.", "We've loved this movie since seeing the Fox Video version in 1994, so seeing the subtitled original was a wonderful experience. So many more details and nuances were clear on the big screen - I highly, highly recommend the experience! Such a sweet, simply beautiful movie.", "What a wonderful and enjoyable film.", "it made me wish I had seen this growing up, it's definitely one that has stood the test of time and very happy I had bought the DVD collection. still nothing like seeing it on the big screen and it's for all ages, the emotions were everywhere, what else could you expect! absolutely enjoyable!"]}
{"title": "Leap!", "comments": ["Carly Rae Jepsen's song for this movie, Cut to the Feeling, is absolutely amazing!!! A great sign for an amazing movie, no doubt"]}
{"title": "Ami Tumi", "comments": ["Full entertainer and lots of comedy", "Did not expect such a crappy movie from Mohan Indraganti..Utterly disappointing....Rod movie.   Vennela Kishore is saving grace..Save yourself time and money and avoid this movie...", "", "", ""]}
{"title": "Colossal", "comments": ["Interesting movie. Had pretty funny moments, some interesting twists that make it worth seeing. There were also subtle messages that aren't missed on the human psyche and bullying. Anne Hathaway always a winner and Jason Sudeikas was good in his role. Movie was slow at times but it ultimately was effective and unpredictable Recommend it", "What this movie ISN'T:  A comedy.  Like not even remotely is this a comedic film.  It has a moment or two of levity, but it's SO not a comedy.  A horror movie.  Yes there are monsters, but again, it's almost secondary.  What this movie IS:  A film about broken, often uncomfortably so, people spiraling into depravity, self loathing, and self distraction through alcohol and (implied) drug abuse.  It's a character study of classic alcoholism, the broken people who attach themselves to alcoholics and drug addicts and sociopathic behavior.  Yes, Jason S plays a bad, bad, awful human being.  The entire theater left almost in silence.  It's not that it was a poorly made film, not by a long stretch, but everyone was expecting the comedy they marketed.", "", "Saw an early screening at SXSW and it was fantastic! A nice change of pace for movie going with all these franchises conquering the market, to see a cool original idea.", "Nacho Vigalondo really surprised me. The film is so much more complex than the trailer. Go see this film!"]}
{"title": "Monsieur & Madame Adelman", "comments": []}
{"title": "NT Live: Peter Pan", "comments": ["This was very well done. It was shown in morning. Needs to be later in the day, better promoted. Would be a good group summer camp trip. Lots of dance, flying, and music.  Only thing that didn't work well for me was tinker bell, played by a non English speaking guy. The total relationship between Tink and Peter was lost.  The female Captain Hook was delightfully evil.  The alligator sort of seemed as an afterthought. If this comes back. I recommend for 10 year olds and up. Adults will love it."]}
{"title": "Good Fortune (2017)", "comments": []}
{"title": "Alien Arrival", "comments": ["I agree with the first reviewer about all the points made. And I paid almost 8 to rent the damned thing!", "This movie was terrible.  Don't waste your money. D rated.", "Well since this movie has no reviews yet, I believe it speaks to the marketable quality of the picture.  Honestly, it wasn't completely horrible but the plot and the direction of the film was hard to follow.", "", "Had great hopes for this movie, but I quickly became confused and feeling like I was missing something. The movie takes a lot of short cuts- the prisoners have mouth guards, and the rescuers are going to take them off. They show a little whirlygig thing, then hold up a violin case and remove the mask behind the case! No explanation as to why the mask guards were on, and even though they were painful looking, no scars. That was just one of many shortcuts, you have to guess what happened between scenes. All about head shots of the actors suffering or emoting, but no tie together of the plot. It was almost a parody of a low budget, dubbed movie- could not figure out what was going on from listening to the actors, had to fill in the gaps. There is a neat theory that goes on at the end, but it is never tied together.   I kept hanging in, waiting to have it explained, but it is almost an outline of a script, waiting to be fleshed out."]}
{"title": "Baahubali 2", "comments": ["The beginning was great,( Baahubali The Beginning) see it first and you'll have to go see the rest of this Epic film.                                                                                                                           No really I mean it EPIC FILM the best EPIC in some time.", "", "Dont waste your money that too double the cost", "Best Direction, Casting, Visual Effects, Music  Marvelous - Amazing - Excellence in screen presentation", ""]}
{"title": "Citizen Jane: Battle for the City", "comments": ["Eye opener.  Jane was here before we got to NYC, so we've been ignorant of her presence.  Now, we know the detriments of Moses, thinking the Robert Moses Expressway in L.I.  gave us the impression that he was great.  Now, we know he was actually a detriment to the great City of New York.  A very awakening example  was given to illustrate the detriments of major urban complexes, particularly those big government projects for the less fortunate folks.  Tall buildings destroy the urban life as they give but a concrete jungle.  Those monstrous buildings in the bustling Chinese cities are very good illustrations.  This documentary should perhaps awaken us of the longer-term detriments,.  Well, China in particular.  With its 1+ billion citizens, it's a big, big problem.  We agree, there should be MORE Jane Jacobs around.  We're very happy that Moses' last grand scheme of the Manhattan Express didn't materialize.  We have enough  grief with the Canal Street traffic, and the Cross Bronx.", "A must-see for all city lovers, dwellers, activists and preservationists. We need more Jane Jacobs!"]}
{"title": "My Journey Through French Cinema", "comments": []}
{"title": "Tomorrow (2017)", "comments": ["We saw it in NYC yesterday.  Wondered why it's not being more widely distributed.  The trouble with these artsy movies is that they don't have Batman or Superman flying around, so it's hard to attraction their attention, as culturally they're different (Ha!).  Not that many are conscientious enough about the environment in our times?  But... disaster is looming on the horizon, coming toward us like a big tidal wave.  The human race may be decimated soon, as the makers here pronounce.  We certain have no reason to doubt, if we continue doing what we're doing, multiply like rabbits, eat up the resources faster than we can produce and supply them.  It's scary just thinking about it, really.  The producers really struck out all 9 pins with 1 giant bowling ball.  Loved it."]}
{"title": "Hindi Medium", "comments": ["Funny", "The story is really good as well as direction and acting. Really enjoyable!!", "Must watch", "Loved it..", "Interesting movie... I'm sure parents are going thru what the movie is depicting!"]}
{"title": "Royal Opera House: Otello", "comments": []}
{"title": "All the Rage (2017)", "comments": ["Terrific documentary about Dr. John Sarno, who didn't get the recognition he deserved for making the mind/body connection for physical pain.  As a therapist, I know only too well the validity of this connection, which is being researched an well documented in mental health. As usual, the medical profession would rather throw pills at the problem."]}
{"title": "Nobody Speak: Trials of the Free Press", "comments": ["The new Netflix Original Nobody Speak Trials of the free press starts out as a Hulk Hogan vs. Gawker story where it seems to start to go the way of man vs. abusive press. As the documentary progresses, one soon finds out this is not the case. It becomes a vehicle for spin as to why the powers that were at Gawker feel they were wronged for running with and publishing a selectively edited sex tape secretly made of Hulk Hogan and a radio jockey's **** wife. Most of the first 34 of the documentary covers the absolute beating Hogan and his lawyers continuously dish out to the people most liable at Gawker. All the while it also includes jabs here and there after the fact as to why Gawker should have been absolved of any wrongdoings and shielded by the First Amendment... of course straight from the mouths of the people directly responsible and their supporters. Throughout the program, there is an ever present Liberal shift going on that increases as the story progresses. CNN is prominently displayed at each turn with MSNBC in an attempt to coax the viewer to believe what is being said is backed up by other separate news organizations. A grand conspiracy-like connection is made and is suppose to be a huge shadow that mysteriously cost Gawker the trial although it has nothing to do with the case or deciding the case in court. No thought is ever given or considered on screen by the former news outlet as to the personal, intellectual, and professional damages that have been dealt to Hogan other than to mention there should have been more damage by additional footage being released. Once we find out the end result of the civil case and that Gawker will be closed and bankrupt the whole program shifts into a mix of anti-Trump and anti-Republican tirades and rhetoric. Videos are presented of the numerous run-ins between the media (mainly CNN) and Trump before and after the 2016 Presidential Election with selective editing and commentary full of disdain for Trump and his so-called shutting down of the press. The liberal views are front and foremost typically leaving out pertinent information. Although somewhat informative when guarding with skepticism, the documentary falls flat on its face trying to save face. The recent outing of the CNN brand of news unknowingly by its own anchors and producer pushing nothing burger fake news shines a bright light as to what this documentary is really about especially when they use so much of CNN's broadcasts. It is a desperate attempt at misdirection and to shift blame from those at Gawker who were held accountable. The writers and producers of the documentary as well as the various supporting cast of news editors, publishers, and reporters appear as fools, after the CNN debacle, pushing nothing burgers of their own and are no more credible in this reviewer's eyes than CNN."]}
{"title": "Fairy Tail: The Movie - Dragon Cry", "comments": []}
{"title": "Jeremiah Tower: The Last Magnificent", "comments": ["If you love food, creativity, and the inspiration behind both, you will love this movie.  Especially well told is how Jeremiah Tower turned the positive and negatives of his childhood into a brilliant and inspired career.", "This an excellent film about the importance, seduction and complex nature of Genius! The loneliness that is underscored in the film as a necessity and natural bi-product of rigorous creative output is spot-on.   Wonderful, sad and beautiful --- BRAVO!"]}
{"title": "Score: A Film Music Documentary", "comments": ["", "There was some discussion of classic Hollywood film composers, but most of the film was about the last 40-45 years. Would have liked to have heard Korngold mentioned. Every new composer introduced seemed to have revolutionized the medium. Still, there was some good footage. A tribute to James Horner by James Cameron over the end credits was particularly moving."]}
{"title": "Lost in Paris", "comments": ["Diane what were you thinking?   Awful script. Wimpy characters. Weak story. And the chemistry between Diane and potential love interest FRENCH dude was non-existent."]}
{"title": "Tommy's Honour", "comments": ["Good old fashion story telling! No shoot-up robots, monsters or smarty pants cartoon characters.", "", "Loved it", "", "I wanted to see the movie because I am going to Scotland this summer. I really didn't know anything about the story. It turned out to be a great movie! I would definitely recommend seeing it."]}
{"title": "Sleight", "comments": ["I enjoyed the movie greatly. The movie is a steady paced film, but the slow burn is do to the development of the story. I thought the main characters development, and how he dealt with the stress of having to provide for his sister and try to escape the life around him was very well portrayed. The magic was AWESOME TOO. Look this movie isn't for someone who wants non-stop action, or someone looking for another Now You See Me. This movie is for those who love that little touch of magic and appreciates that heartfelt realism of someone struggling to make something better for the ones they love.", "I wanted to love this movie, but it was poor executed for such a great concept.  The villain seemed completely fake, and how many times does a movie have to downgrade people of color by making them a parent less/drug dealer/criminal.  They wouldn't pull this mess with a Caucasian hero.  Quit it Hollywood!!", "I was so hype about this movie based on all the trailers I watched in the past.  I was let down brutally and wanted to drift off to sleep during much of the movie.  Sleight had a lot of potential but it just did not move me the way I thought it would. (No pun intended!) I would not see this movie again and the ending did not leave me wanting more.", "The whole movie was a buildup to nothing. Seemed really long for such a short movie. Disappointing to say the least.", "SJW BS FU BLM"]}
{"title": "Ripped", "comments": []}
{"title": "Like Crazy (2017)", "comments": []}
{"title": "The Ornithologist", "comments": ["Insult to the movie-goer's intelligence kind of a pic?  The guy binoculars birds around in the water, and got in trouble, got flushed downstream.  2 lousy Chinese hikers found and revived him.  The 2 women certainly are no reasonably smart hikers to begin with.  They somehow tied him up for reason unknown to us (we didn't fall asleep!).  Then, he escaped, only to meet up with some stranger characters whose presence was unknown.  DON'T WASTE YOUR $$$."]}
{"title": "The Case for Christ (2017)", "comments": ["I won't spoil the movie. I'll just say wow, this movie was touching and powerful to me. Lee Strobel, the main character of the movie, had doubted God's love through his life until through being shown love, discovered God. It's a beautiful story, but not boring at all. It's actually a very involving and exciting story. It doesn't shove Christianity down your throat. It lays out the evidence and testimony of God's grace and love. I totally recommend seeing it!!", "What a beautiful way to show people that we are all flawed and have questions about Faith. What a brave step for Lee Strobel to expose his former life as an atheist, allowing everyone to see him struggle and question God. So many touching moments that hit home. I cried almost the entire movie, because it's amazing to see the power in how God can change your heart. I recommend believers and non-believers to see this movie. To some it may just be a movie, to others it's a man who sought the truth and found eternal peace. Christians only want others to feel that love, peace, and comfort we feel. Simply beautiful.", "I would recommend this to anyone, whatever your belief.  Don't let the title scare you away, as the man who it is about was a fierce atheist.", "Great movie, especially for skeptics.", ""]}
{"title": "Their Finest", "comments": ["A perfect blend of artfulness and the deepest of feelings. Bravo to the fine cast, writer and director.", "Love those Brits. This movie was an exceptional narrative of life in England, in particular English cinema making, during WWII. It mixes British and American wit and humor with the pathos of war. Spiced with fictional British propaganda to light a fire under our US arses, we gain a little understanding about the difficulties and stalwart nature of our cousins across the pond during this most challenging time in world history. Imagine an almost casual cadence after your office building has been bombed, stepping over torn bodies in order to get home. And yet one does not feel as much the terribleness of it as the resolute nature among those affected. Bill Nighy is the nucleus despite a triangle romance among three beautiful characters.", "What a terrific movie!! I'm looking forward to seeing Dunkirk when it comes out but, yesterday, my wife mentioned this movie to me. We read it's description and a few reviews and figured we'd give it a try. It's spectacular and way, way better than we expected.", "I was pretty shocked to see the 3.5 star average in these reviews. I was pretty enthralled the whole movie, and it does a good job of developing all the characters and the time and place as well. Seeing the film grow and change and develop and adapt amidst a film that's doing the same thing is exceptional, and the originality and complexity in emotion and dynamic is refreshing. Their Finest is surely some of their (UKs) finest.", "Boring movie to me."]}
{"title": "Free Fire", "comments": ["This film was interesting, even though it's mainly comedy there were some intense moments that had me pumping, Gotta love that head being slowly run over ????", "", "this movie was the best movie this month !!", "", ""]}
{"title": "CHIPS", "comments": ["Of course this movie is raunchy, it's like 21 Jump street and We're the Millers rolled into and hour and a half long explosion and laughter festival. If you love college humor, explosions, and pretty girls you'll love this film.", "Dont understand the pompous critics, this isn't supposed to be Othello . Great fun movie entertaining all the way thru.", "One word: FUNNY! If you need to simply have a night away from the seriousness of your everyday life watch this movie. Pena is hilarious. It's been a long time since I heard an audience belly laughing the whole movie.", "The new movie Chips sucks! @%& is this the worst movie ever!! My wife had fellow teachers over for dinner, I had an idea to skip out and see a movie, what a waste of time and money, why was this movie made? who wrote this sceneplay, who approved it? they had the actors the money, the location, yet the movie made no cents a high schooler could have written a better script!!!! as a  28 year California  POLICE OFFICER I was offended...", "A horrible use of the title 'CHiPS'......??????"]}
{"title": "The Belko Experiment", "comments": ["Oh my god too many scary scenes and jump scares. It was soo bad that at one part of the scene, after I finished my chicken tenders, a jump scare scared me soo bad i literally screamed at the top of my lungs and accidentally pooped my pants! I immediately ran out of the theatre, it was embarrassing but still, scary! I enjoyed it even though I had to leave halfway through because of my accident!", "The Belko Experiment was garbage. A very, very dumb movie with piss-poor writing, 0 creativity, non-dimensional characters, and no discernible point whatsoever. This was the first movie since I Now Pronounce You Chuck & Larry that myself and other audience members got a refund for. Audible groans could be heard within half an hour and everyone kept checking their phones to see how much time was left in this abysmal flick. It's that bad. Avoid it at all costs.", "So after having a rough week at the office I was going to see Beauty and the Beast but I was more in the mood to see a darker suspense movie.  I never saw any advertisement or previews for this movie but did watch some reviews online.  I also watched the trailer to see what the movie was all about.  I thought it was a really good premise but in the end it was a little too bloody/violent for my taste.  The overall story and suspense was good but it did have its moments.  I would recommend it if you would  don't mind seeing a lot of blood/gore", "Horrible!", "I enjoyed this movie! The actors and plot were a little lacking. There was lots of gore, but that was to be expected. Overall a success. I will watch the sequel!"]}
{"title": "Vanamagan", "comments": []}
{"title": "The Shack", "comments": ["I have never gone to bat for a faith-based movie the way I'm going to after seeing The Shack.It is a beautifully well-done, profound, loving and amazing faith-based film packed from start to finish with an amazing story of how God chases us in our pain, our deepest valleys and sadness while encouraging us to become better people, loving more, forgiving more, letting go of more. I can't personally recommend this movie enough. So beautifully well-done! It's one of my favorite movies of all time and the absolute best faith-based film I've ever seen!", "Omg truly inspiring and I cried alot. Worth it. God is good all the time and all the time God is good. Loved Sam Worthington and Octavia Spencer acting performances well done.", "A man experiences a terrible personal tragedy and gets stuck in his bitterness and pain.  This movie chronicles God's love and care in drawing the man back from this dark place into hope and joy and right relationship with Him.   So many negative things have been said about this movie, but people need to give it a rest.  This movie speaks a lot about forgiveness and hope and trusting God no matter what.   It is worth seeing with the whole family and can lead to lots of fruitful conversations about where God is when it hurts and how to follow Him together.", "This movie is great!!! It should be watched by everyone... If you are full of hate and want explanation, then this is your movie to find out why. You must go watch it and stop with the whole, not another christian movie. So many cultures and stereo types and this will change your mind!", "This movies was so good, I read the book and the movie was almost just like the book and I think that's really good, I like the movies to be like the book, the movie was so good, it had everything a movie needs and it had a really great story line, Loved it"]}
{"title": "Food Evolution", "comments": []}
{"title": "Anbanavan Asaradhavan Adangadhavan", "comments": []}
{"title": "Ghost in the Shell (2017)", "comments": ["The first hour really built the story up and will possibly lose some viewers however the ending and final half-hour is worth sticking around for. The storyline really comes together and the action culminates into an awesome ending. Scarlett plays her role very well and makes the film more enjoyable. It's definitely worth watching and would be a 7/10 rating or in this case 4/5 Stars.", "It's super great! The producer shows a lot of respect to the original work and it has excellent graphics and actors. I did not expect anything before I actually went to the theater. It definitely worths me going to the theater again!", "It captures the essence of the original, stunning visuals, and slight plot alterations that make a perfect story - open to continuation", "Well, that was incredibly different than the animated film and just managed to piss off a LOT of people in the auditorium. Visually stunning, but so many of the important elements weren't there, the philosophy of it all. And that ending is terrible. This one isn't gonna please a lot of people. That's disappointing. The core essence of Ghost in the Shell isn't there.", "Interesting concept for a story line. Humanity has begun to fully synchronize with robotics and humans as we know? become less and less human. But the story never grabs gold of you in a personal way. You can't relate to it in any way and so the movie drags on.  The effects were just awesome! Fantastic! And Johanson looks amazing the entire time. But what a waste of talent."]}
{"title": "Dean", "comments": ["Funny movie, loved the illustrations.", "worth seeing in a sea of movie monsters and bad guys along with slap stick comedy....this one made you think and was not overly predictable..........easy to follow with the angst everyone goes through in life..............well done..........and loved the cartoon drawings", "Really enjoyed this movie, very funny & sweet.... would definitely recommend it!", "What a refreshing movie about a serious subject but light hearted and told in a unique manner.  Congrats to Dean", "great parallel of grief between father and son.  enjoyed all the actors.  will recommend this film to friends."]}
{"title": "T2: Trainspotting", "comments": ["fantastic! Can't wait to see it again!", "Very few sequels deliver. This certainly did! Better than I had heard and imagined. A must-see now!", "Solid movie that makes you kind of sad that things turned out kinda like you figured they would for these guys.", "No reason to be", "Better than the original. If you were the age of these blokes in 1996, a must see. The scenes where they delve into issues of recovery and aging really resonated..."]}
{"title": "A Quiet Passion", "comments": ["See it! I absolutely loved Terence Davies' A Quiet Passion. A rich, moving, emotional biography. The attention to detail remarkable and painstaking. Costumes gorgeous and accurate. Wonderful to hear Dickinson's poetry. The shape of the house, the grave evoke the shape of her manuscripts on scraps of paper. One comes away understanding why she did not publish more in her lifetime. She was ahead of her time. She protected her process and poetry. You will experience her 'quiet passion', experience what life was like for her. See, if you can, the exhibit at The Morgan Library in NYC. You will see how one of her published poems was dwarfed midst a sea of newspaper text and ads. Davies has done our brilliant Emily justice. All the actors are wonderful. It is a jewel of a masterpiece.", "If you are a Fast and Furious fan this film is not for you - Don't see it if you want action rather than substance - this is all about the substance of a human journey.  This is a slowly developed, exquisitely detailed study of the emotional and spiritual development of Emily Dickinson ... The wit of Emily Dickinson and the other repressed/oppressed women in her circle provides some relief from the painful journey with Emiiy's soul ... It was a mixed sense of relief when the torture of the soul ended ... very moving ... a masterpiece. The cinematography and lighting were perfect- drew me in immediately -", "The acting was exceptional but the monotonous flow of the movie actually had both me and the mrs nod off for a good 20 mins", "Appreciated the weave of Dickinson poetry throughout the film.  The flow between time periods and events abrupt; lending well to the poetic readings, but difficult for a viewer learning about her life.  Beautifully acted.", "About half way through the movie I began praying that the film makers would not stoop to using because I could not stop for death... to close the film at Emily's impending and inevitable death. But no, they could not resist. After two hours of being bludgeoned by witty repartee and torrents of tears interrupted only by confusing non-familial relationships, they could not resist illustrating each line on crystal clarity lest we, presumably people who had some interest in the poetess, miss the meaning of it all. One final blow of the cudgel after two hours of long shaky views of tiny rooms and too many questionable dialogues.   I heard one person whisper to another 'was this filmed at her home?' a reasonable question since we were within easy driving distance of Amherst. That trip and a free pamphlet would have been more satisfying and informative.   Save two hours and movie money, buy some poems by Emily Dickinson and go to Amherst and you'll be well-served, with or without popcorn."]}
{"title": "The Journey (2017)", "comments": ["I expected this to be a dry tale of history but it's done with a lovely undercurrent of humor, really explaining without explaining part of the Troubles and is shot in lovely countryside.  A feast for the eyes and mind"]}
{"title": "Love, Kennedy", "comments": ["This movie is so inspiring and uplifting!!! I highly recommend everyone go and see it. I plan to buy this movie when it comes out too!!", "Wonderful, uplifting movie that was so tastefully done!", "A must see! A trumphiant true story of hope, faith, and family.  Don't miss this film in theaters.", "This movie is over the top amazing don't hesitate to see it", "Loved this movie and that it was based off a true story.  The best feel good movie I've seen all year!"]}
{"title": "Life (2017)", "comments": ["I did enjoy this movie and it is very scenic and has tons of special effects and many, many Alien chasing people, high suspense scenes.  Fair amount of icky Alien gore so I felt I got my Alien Horror fix satisfied somewhat.  The biggest drawback was so many gaping holes in the plot for a sci-fi geek like me.  Above all, once again, like in Prometheus, what's with the petting unknown alien life forms like they are bunnies or puppies at a petting zoo.  Didn't any of these writers ever read or see Michael Crichton's classic The Andromeda Strain where he described the kind of laboratory & scientific methods alien life forms need to be handled with?  Like with mechanical hands in tightly sealed lab rooms.  Not by hand, even with rubber gloves--no one is shocked when the nasty Alien monster just bites through.  Although the one in this movie makes itself a home made 'shank' in the lab to cut through the rubber gloves and escape.  Smart, vicious little Alien.  Enjoy.", "", "I love Sci Fi but this blatantly plagiaristic movie is not going to be classic, Ridley Scott has nothing to worry about. Like in most PC movies the lead scientist is the least likely to be the lead scientist,(see: Dr. James Watt) then a mention of Syria and how humans suck and a comment about seeing borders from space. The usual f ilm a ctors g uild propaganda. The creepiest thing in this flick is Jake Gyllenhaal's grin (The one from Donnie Darko). It's very predictable right up to the ending that you will know as soon as they make the plan. All in all Sci Fi's are like pizza, even when their bad you still eat 'em.", "This actually was the first movie in my life that I wanted to walk out on. You could see what was coming from a mile away. Imagery and emotion were so forced. Cinematography and directing was awful/lacking. Someone tried to catch scenic shots like in Gravity w/ Clooney & Bullock, but missed the mark terribly.   Not to mention, the scene where they're swaying at a table to give the allusion of low gravity--awful! And I got a headache in the beginning from the unnecessary camera spinning around shots. If I was a scientist or in the dept of defense I would be insulted by the crew's portrayal. The people that go on space missions are highly trained and SMART! The crew in this movie were making careless & irrational decisions.", "Just seemed like the best and brightest of NASA missed the boat."]}
{"title": "Wakefield", "comments": ["Film had a lot of press from Bryan Cranston but it's so limiting! I was so very bored....There are other films or books that would reveal more than this film did. No resolution and the ending was like the rest of this film:empty and dissatisfying.", "Bryan Cranston did an amazing job keeping this movie alive. I couldn't take my eyes off of him. It was funny, dramatic, and just overall great performances from everyone. I'll admit it got kinda slow toward the end and I was just waiting to see if he would go back to his family. But the performance of Cranston alone makes this a 5 star rating. This is a really good movie and you should go watch it!!!"]}
{"title": "L'embarras du choix", "comments": []}
{"title": "Your Name.", "comments": ["Great movie for all ages and for anyone that doesn't like anime. Great plot and character development. Fantastic film score and great music ( shout out to radwimps ). This is pretty much a modern day spirited away quality film but better.", "Phenomenal", "I've already written a review, but wanted to add this. This isn't a Freaky Friday rip off. You mentioned the first five minutes; I don't think you got to the curve ball of a plot twist that makes this movie so magnificent. The Japanese have their own writing elements and influences so I really don't think they were trying to mimic a crappy American movie that lacks so many aspects that this film has and one that is solely comedy lacking depth. There are only oh so many ideas in this world that can and will be naturally repeated. How many times have you seen a variant of the Jesus-messiah savior character story. It's like going into a café and hearing a conversation that you've heard elsewhere before and then flipping out about it while saying they aren't original, though I would argue that this movie is incredibly original amongst all of the remakes and rehashed movies we have now a days.", "Love the characters, story, and plot twist. It lives up to all the hype and is definitely worth watching!", "watched for the second time with English subtitles and just as awesome, the emotion and scenery still pulls on me and I can't wait to own both on DVD someday and watch over and over again!!!"]}
{"title": "Manifesto (2017)", "comments": []}
{"title": "The Lovers (2017)", "comments": ["Seems to me, if your going to cheat on your spouse find someone who is better.  These two alternative partners were pathetic.  It felt like a junior high romance by some very bored people.  Not an uplifting movie with some very flawed characters and an ending that was hopeless..good luck", "Debra Winger is making a comeback and she couldn't have done a better job with this movie!", "Hated it!  Unrealistic. Disappointing   Trashy.", "Very slow moving. Effort not to fall asleep", "A midlife marriage in crisis. It's so realistic, it can happen. It's funny and it's sad."]}
{"title": "Logan (2017)", "comments": ["Logan is the last film in the trilogy of Wolverine films, but also marks Hugh Jackman's last performance as Wolverine in the X-Men universe. The film also marks Patrick Stewarts last outing as Professor Charles Xavier in the X-Men universe. So, how does this last outing film hold up? Is it good, is it bad, is it ok? Let's dive into it, shall we?   Off of first impressions, I am completely blown away by this film. It is totally different than any X-Men, heck any Wolverine film before it! Hugh Jackman himself did an absolutely beautiful job on this film. I could tell that he literally put everything into this film and it definitely does show in this film as well. Patrick Stewarts portrayal of a aging and trash talking Charles Xavier was hilarious but at times really touching. I honestly felt that the two, Jackman and Stewart, were a great pairing for this film. But it was interesting how with this film being rather serious and very brutal, oh so brutal, there were comedic moments that actually within that type of story. When a film can do that, do it successfully that is, I am always impressed, as I am with this film. The girl who played X-23 was also extremely good. For a kid actor, she was very good within this R rated film. There are so many other actors who played their roles extremely well, but everyone really did a great job.   The story was also very touching, saying it's technically about the last days of Wolverine. The characters within it all serve there purpose, and honestly I don't feel that any character was wasted at all. Every person had a reason for being on screen, and it made the story that much better because of it. Essentially, the story arch is a road trip, so we meet different people, while Logan is being pursued by, basically, Mutant hunters. X-23 and Logan do not get a long at first, but as the film progresses, they do form a strong bond. The plot line with Xavier was also very interesting. Through it we learn what has happened in the past 15-20 years. We also learn of what he is capable of now and what effects it has, which just saying, is extremely bad. The whole plot line for X-23 was also interesting and very close to Wolverines backstory, which makes sense when you think about it. So story wise, really on point.   Action wise, holy crap. When there was action, there was action. I'm glad this film was rated R because to fully see what Wolverine and even X-23 were capable of, it had to be done in a R rated film. A PG-13 film could not do this justice, it wouldn't even come close. The kills in this film are also extremely brutal. I mean, rated R brutal, and by that I mean so brutal that it's not for the weak hearted at all! You have limbs and heads and everything getting cut-off, so, yeah, action and killings extremely brutal, but extremely awesome as well.   The final thing I want to touch on is the mutant hunting group. Headed by Richard E. Grant's character, they claim that they can control mutants by killing them and mixing tissues together. There's one thing they make that I won't spoil, that probably could've been left out, but at the same time, it was actually pretty awesome to see. The man with the metal hand too was a loyal servant for the mutant hunters, and he had a few moments where he was pretty clever. And the interesting bit is, if you remember the original X-Men films, apparently this group is based off the same program that gave Logan his claws, heck it runs in the family, not going to explain how though, you gotta see the film to find out.   Overall though, when it comes down to how good this film really was, it was the best X-Menish film Fox has made for awhile. The direction behind it, the acting, the story, everything, was just perfect. I couldn't have asked for a better film. Logan is truly a great film and I highly recommend that everyone, who is above 18, no kids, go see this film and witness the last chapter in The Wolverine and Professor X story. You will not be disappointed!", "The movie is amazing.... the R rating suits the movie, and the language doesn't seem forced.... the violence is in point... and the drama is amazing.... it's a must watch", "From the very beginning the movie felt disjointed. It seemed like they were trying to give the movie an edgy violence similar to Deadpool. Because of this, the characters were not at all what you've come to expect through the other Xmen movies. The storyline leaves you wondering throughout a majority of the movie, What is going on? and Why is this happening? That having been said, Patrick Stewart and Hugh Jackman deliver great performances, but not even they can right this sinking ship.", "After 17 years in nine films as the Wolverine, Hugh Jackman outing as the Wolverine comes to a close. Watching this movie from start to finish has become easily one of my favorite films thus far. A story taken from the graphic novel of the Old Man Logan story that tells the struggle and life of Logan. This film is absolutely amazing and the new character, X-23, well let's just say she's a bad*** along side her daddy. The best Marvel movie of this year that happens to be an R-rated cinema. Great movie with action and brutality as the way Wolverine should be.", "I liked the movie"]}
{"title": "Dure Soirée", "comments": []}
{"title": "Past Life", "comments": ["After seeing this film I wondered how I was going to get those lost two hours back!  I did not like this film and it wasn't because of the sad situation that happened during WWII and the Jews caught in Poland, it was because the film did a poor job explaining why we were suppose to care for the main characters.  The father of two girls is accused of being a murderer and you don't get to find out why until the end of the film.  The signing and composing were poor attempts to tie plot lines together, yet they have nothing to add to the film.  I found the actors straining at their roles as if to ask, why am I acting in this film.  Then if you couldn't add more drama, you throw in unexplained bloody noses and cancer.  This is not a film I would recommend seeing.", "This was a beautifully  written and fantastically  acted film .  Everything about it was so real.  I was crying at the end.", "Great film !", "Compelling, heart wrenching profound."]}
{"title": "Macbeth Met Summer Encore", "comments": ["Bravo! The Metropolitan Opera produces the most beautiful and entertaining performances with the best talent and incredible production.   Look forward to seeing this 2016-17 rebroadcast and all the other Live in HD future performances from the Metropolitan Opera 2017-18 season.", "In my opinion, the team that records these videos at the MET, have produced an event more enjoyable than live theatre. I'm not going to spend hundreds any more to squint at a stage. This is a thrilling experience, both for the visual and sound. Perfection. Macbeth is my favorite opera, and this is now my second favorite performance on video. The vocal talents are outstanding, and the production concept and design enhance that dramatic impact. Very creative and innovative. Can't wait to see more! BTW, my favorite production of Macbeth? Glynnebourne with Kostas Paskalis and Josephine Barstow. Bone-chilling and thrilling!", "This performance took place in 2014. Miss Netrebko gave a wonderful performance as the scheming Lady Macbeth, the true star of the opera libretto. Messrs. Lucic, Pape & Calleja were strong singing and acting presences in their roles of Macbeth, Banquo and Macduff, respectively. The minor role of Malcolm was also well sung and acted. Banquo's ghost at the banquet was very cleverly presented, also the vision of future kings. Having recently studied this opera (with a wonderful recording), I was looking forward to this encore of a live performance. However, I am not a fan of the updated settings and costuming. The witches looked more like refugees than a malevolent coven. The soldiers' uniforms & especially their weapons were distracting. Lady Macbeth seemed properly attired in only the banquet scene. Birnam Wood did not have even the appearance of its prediction, just vertical sticks, not leafy branches. The chairs were odd, and the walk-away end of Lady Macbeth was just strange."]}
{"title": "Power Rangers", "comments": ["This **** was lit!!!! Wayyyy better then I thought it would be", "It isn't complete garbage! Cheesy with dialogue cringey as all get out, pretty much what you'd expect. Almost exactly like the 90s Rangers but with today's studio money backing the production, so ya know, large-scale action and cgi. I had a blast, even if there isn't a lot of Rangers action. This is more of a Breakfast Club style character study, an introduction to everything. I can't wait for the next few films! This new franchise can thrive and do amazing things provided it makes enough in sales - and my god, that mid-credits scene.. If you plan on seeing this, stay a while afterward!", "Definitely proud of this movie. It took me back to when I was a kid. Very happy that the people who made this movie put more a realistic feel with this film. Yes it had its slow moments but people when seeing this movie have to have the mind set that this is an origin story and most likely the second film will top this one. Overall satisfied with the movie. Can't wait for the next one. GO GO POWER RANGERS!!!", "A morphenomenal reimaging of a classic franchise. A crossblend of Chronicle meets The Breakfast Club but surprisingly it works! The character development was a real surprise since in the original Power Rangers series, that didn't exactly exist. There's a good blend of cheesiness that fans that watched MMPR grew up with as well as solid storytelling to make for a great time. If you go into this expecting for a purist Xerox of what you watched growing up, you'll be disappointed. But if you go into this with an open mind looking to have a fun time, you won't be disappointed. I was very impressed with the overall performances of the entire cast especially Elizabeth Banks as Rita Repulsa and RJ Cyler as Billy. Fans of the franchise and even those who didn't bother to care for it before should watch this. It's a very fun film that makes you feel like a kid again. As they said in the 90s, It's Morphing Time", "As a 24 year old, I never really got into Power Rangers growing up. Went because my boyfriend wanted to watch it, but I have to say, it was pretty good. Better than what I expected. Very cheesy (but it is a kids movie, so I get that), very funny, but not a lot of Ranger action (hence the three stars). It had a more Breakfast Club feel to it. But still liked it."]}
{"title": "Super Singh", "comments": ["", "sirrrraaaa movieeee", "Bad movie", "siraaaa lataaaaa diljit ne burrrrahhhhhhhhhhhhhh. awesome fim", ""]}
{"title": "Norman (2017)", "comments": []}
{"title": "3 Idiotas", "comments": ["", "", "Best movie I've watched by far!! Hilarious", "Awful", "I almost skipped this movie, because of the trailer. It looked like a poor attempt at a comedy movie. However i was completely mistaken, when I decided to give it a try. The movie does have its funny moments, however where the movie truly shines is in the message of the concept of school and learning.   Unfortunately the movie was overshadowed by a unfunny and misleading trailer. I hope people can forget the trailer and give it a chance.   And to everyone saying this is a ripoff to a Hindu movie, it's not necessary a ripoff, but a Latin remake. The movie does pay tribute to the original at the end of the movie."]}
{"title": "Unforgettable", "comments": ["Good script, good acting, casted correctly, good direction and production values.  Story does not drag and well edited. Had me jumping in my seat a few times. Impressively put together.", "Movie was good", "I was so excited to see this movie because I love Katherine but it was exactly like a made for TV movie. Save your money a Hallmark movie at would be better!", "I enjoyed this movie! Worth seeing", "Pretty predictable. Typical Lifetime movie. Nothing special."]}
{"title": "The Bad Batch", "comments": ["Excellent filth, very entertaining !", "Had potential but tried to be way too artsy for my taste.", "The movie is mind blowing great but until you break the code you don't realize that it's also gigantic.  This isn't a real story. It's a visual poem describing what it feels like immigrating to America...what the (American) Dream looks like for most...what you have to do to really live, here . Amirpour is looking at the red white and blue..reminding us we started out as ...and may still be ...somebody else's Bad Batch .", "Best film of the year", "perfect."]}
{"title": "Can We Still Be Friends?", "comments": ["Was a hot (104) Sunday afternoon and the a/c in the movie house was perfect for a cool nap.", "the show time and theatre location are a good formula for this movie to lose money. bad bad deal."]}
{"title": "The Circle (2017)", "comments": ["Ok, so the ending needs a little work, and the sinister plot is a little over the top - but let me tell you, not by much.  I currently work for one of these left coast wunderkind companies and I sit in meetings where this exact same stuff gets talked about almost every day.  The campus scenes, the interviewing scene, everyone's smarmy social self-confidence, an entire company run by mostly young childless single people - they got it pretty much right.  It's an out of touch self-serving bubble work environment, and this is exactly what it is like working in that bubble.  It seems like some reviewers don't like this film because the subject is uncomfortable, or they don't believe it.  Those of us who work in these places know better.", "In one of the first scenes, Mae, Emma Watson's character, is interviewing for a job at The Circle (think Google and Facebook combined and/or had a baby). The man interviewing her asks her what her greatest fear is. Unrealized potential, is her nearly immediate answer.   Sadly, unrealized potential seemed to be the theme of the film. The actors tried, but you can only do so much with a sub-par script and horrible pacing.", "This film tries and terribly fails to talk about the growing infringement of privacy rights by the collaborative efforts of our government and tech companies. It underestimates the intelligence of its audience and includes Emma Watson as the typical millennial to have every single thing explained to her in her childlike naïveté. Tom Hanks was Great, but only in it for 10 minutes, as were John Boyega, Karen Gillan and Patton Oswald, Ellar Coltrane, of Boyhood fame was one of the worst actors I have ever seen on the other hand. All drama is set up in an astonishingly dim witted fashion, there is no nuance, it is a dull film that sadly disgraces Bill Paxton in his final roll with his use as a cliched Hollywood pity character that made me sad for him and mad at the editors/writers/directors beyond belief. Just getting good actors can't save an atrociously addressed and structured film with an interesting premise that was mindlessly fumbled. A 2 out of 5 from me for the poor actors.", "Although I love both actors/ actress in this film there was a lack of depth to the characters, plot, and suspense. Everything seemed rushed as through they picked out the few parts based on the book and left the rest to chance. Wait for amazon or vudu because the ticket price isn't worth the film.", "Sucks and this is an understatement!"]}
{"title": "Letters from Baghdad", "comments": ["May be I fell asleep?  I just didn't understand what each scene that the woman was shown in the historic archival material meant.  Swinton's voice was OK, but... When I woke up and walked out, I was wondering what each of those scene was trying to tell me.  Bad story telling."]}
{"title": "The Wedding Plan", "comments": ["", "Well who doesn't love a happy ending and a channukah miracle!", "The sweetness of the story added to the rich cultural detail make this an unusually deep film. We're cheering for this incredibly determined heroine even as we marvel at her commitment to her quest and her religion. Definitely worth seeing on many levels, not least of which is exploring the power of absolute faith.", "Who doesn't love a film that is built on the hope of a miracle?  No spoilers but a truly beautiful film, excellent acting....one of the best films I have seen in awhile.  Grab a group of girlfriends and head to the movies!", "My first reaction was, Ouch!  This did not look like what I signed up for.  It's not even in English.  The scenery is as desperate as the main character.  In fact, this remarkable movie has very little to look at.  The primary joy is in the fact that no one pretends otherwise.  If you found your true love with ease IDK, the rest of us can relate."]}
{"title": "The Lost City of Z", "comments": ["There's a lot of melodrama and unfocused writing in this film, and it drags on for 2.5 hours. If a film offers to take its audience on 3 repetitive trips to the Amazonian jungle, it has to deliver on the visuals at the very least. But sadly, each trip to the jungle was less rewarding than the last. The actors climbed through the same dense jungle terrain again and again in slightly different clothes and progressively more makeup so as to age them the 5 years that had passed between each trip.", "Few films go out of their way to stay in tune with the plush details and tone of an era and now throwing in modern adventure and action sequences while staying fresh and intriguing. James Gray was able to do that here. Sit back in your seat and take it all in. I didn't need Percy to be a modern day Indiana Jones, he was plagued with obsessive conquest and failed. That truth was warranted and honest. It didn't take away from the journey and truth of their experiences. I thought Sienna was enlightening. She really impressed as well did most of the cast. Charlie really led this adventure and Pattinson sure impressed.", "Enticed by reports of grand cinematography (Roeper) I expected good things but found the acting hard to watch (got sick of lead actor's changeless expression) and found the filmography surprisingly drab, flat, lifeless - like it was shot on a back lot.  I read the book and it was NOT brought to life by the bad screen play. The movie was scattered, fractured,  unbelievable. Paramount in the book were the insect plagued hardships - the movie showed exactly one (1) bug that I could see.  There were many strange, disconcerting bits:  - 1st trip was to survey and trace a river to its source. In the film this was done by ... drifting UPstream! - surveyor shots were of two guys standing a few yards apart and looking at a big ruled pole. - ALL the deep jungle natives spoke Spanish. Huh? Convenient. - WWI experiences portrayed were just silly. - In the movie, Fawcett spoke at the Royal Geographic Society and was loudly, almost violently jeered for suggesting an ancient high civilization in the jungle. The next minute (literally) he had a rousing 100% ovation for his return to search for Z. Huh?  The real life Fawcett inspired the Indiana Jones stories. Indeed he had a following (in the US) of millions eagerly awaiting his reports. But the film just utterly failed to capture that feeling the same as it failed to capture much of anything in a credible way.", "It was an interesting movie, but way too long. I also thought they didn't capture the essence of the obsession with finding the lost city. However, it was very interesting and perhaps I rate it a little higher because I previously read the book and had some additional context that others may not have.", "What a snooze fest!!!! It was a horrible movie!!! No action!!  The dialogue was utterly useless and boring!!! I could have taken an two hour and twenty minutes nap!!! That is how long this dreadful movie is!!! Don't see it!!! What a waste of an evening!!!!????????????????????????????????????"]}
{"title": "Maudie", "comments": ["Exceptional film with a very moving performance by Sally Hawkins. One of Ethan's best!", "Very interesting and surprisingly moving.", "Kudos to Hawkins and Hawke.  Hey both HAWK's.  Nicely done.   A bit slow here and there, but... OK, we got through it.  Typical I guess.  Just read the synopsis; she's had RA.  The picture didn't really emphasize too much on that, except for 1 brief moment she asked for some meds I think.  Could have emphasized her art a bit more.  There were moments showing her painting, but perhaps more articulate scene needed to highlight her art.", "Sally Hawkins embodies the spirit of Maud, a disabled woman belittled and marginalized by her family. She lights up the screen. Do not miss this film.", "The characters drew you in! Very moving!"]}
{"title": "The Women's Balcony", "comments": ["", "Disappointed.", ""]}
{"title": "Churchill", "comments": []}
{"title": "The Zookeeper's Wife", "comments": ["Don't listen to the Critics - who does anymore? they are wrong!  Im very picky about movies and WOW - is this a GREAT movie and SO memorable!  What a wonderful story Ok it IS a war Story - so yes you do see some brutality against people and some with animals - yes you are watching a war movie!  BUT the Story is SO well told and riveting - I sat with theater full and we were all moved and in tears!  These people were SO brave!  They saved over 300 people - THAT is a story worth telling - especially in this day and age when its ALL about what's good for us and not what can we do to help others!   There is SO much garbage in theaters - THIS was refreshing!!!  GO SEE IT", "Yes animals are killed but so are humans. Bottom line is the acting was extraordinary. The story is heart wrenching. Based on a true story.", "I look forward in seeing this film. Another heroic story during WW2. Jessica Chastain IMO is one of the greatest actress's in Hollywood.", "Definitely put this movie on your must see list!", "I went into the movie without reading the synopsis-- I thought the movie was about saving animals during the war, but all were killed within the first half! (No, I am not ignorant to the atrocities committed against >6mil people during this dark part of our history. I just want to highlight that the movie is not about a Zookeeper/wife caring for the Warsaw Zoo animals during the German/Russian invasions.) That aside, I had a hard time emotionally connecting with the characters. This is not a Life is Beautiful-- you can wait to rent this one on iTunes."]}
{"title": "Born in China", "comments": ["My wife and I saw this movie yesterday and while we admired the incredible footage of China and the amazing close ups of all the animals. we were appalled and deeply troubled by the heartbreaking finish to the Snow Leopard saga. In all good conscience how could the film makers make us so vulnerable by having us identify so closely with the Snow Leopard family and then show such cruel footage at the conclusion. With all of Disney's resources, which we were shown, which included cameras, tons of equipment, as well as tremendous man power, why couldn't they have brought a Vet team to minister to the wounded, dying Snow Leopard mother. Ironically, World Wildlife Federation, who promoted this film, has a section of the website saving the endangered Snow Leopards! Well, here are two orphaned Snow Leopard cubs you can start with.  In conclusion, if you love cats or animals in general do not see this movie.  You will be deeply troubled and shocked by its ending.", "The movie is beautifully shot and does a great job showing some of the gorgeous landscape of China and four of its native species. I really do wish that I had known beforehand that one of the four animals they track and her babies die (we only see the body of the mother, but the cubs are too young to defend themselves or hunt). One of the young girls in the theater started screaming and crying (I was crying myself and left the theater feeling sad and angry).  It may not be the best movie for some people even with the 'circle of life' stuff they spout at the end.", "the ending was not what one would expect in a Disney  family friendly movie.  I'm sure the crew were instructed not to interfere with nature but in this case I disagree with that decision.     My last DisneyNature movie.", "Normally I didn't write review for movies. However, I highly highly recommend this movie! It is amazing!", "The animals were adorable and hilarious. I always enjoy learning about the lives of creatures in other parts of the world. HOWEVER one of the main characters dies and it broke my heart. Disney tried to tie it back to the circle of life, but it was really devastating for me. I even get sad when the prey gets caught. So definitely go support DisneyNature, just be cautious if you are sensitive to dying animals (even if it happens every day in nature)."]}
{"title": "Gifted", "comments": ["What makes Gifted stand out is the performances in it. The story is straightforward and nothing that breaks new ground, but it doesn't have to. If you're looking for a story with heart and family, then I'd say watch it. Fun dialogue, a great kid actor, and a heartwarming experience. I think it's good to take a break from all the explosions every now and then and just watch a nice story. It's nice to see Captain America take on a more real role. Chris Evans does excellent work in the Marvel films, but every now and then he does something else to remind us that he really can do anything. It's refreshing to see. Marc Webb (500 Days of Summer, The Amazing Spider-Man) delivers a story with good pacing and makes you feel for the characters. I don't think it's a movie you HAVE to see in the theater, but it's better than most of the newer releases. If you're saving your money for Guardians of The Galaxy Vol. 2, then you can catch this on Netflix or VOD later.", "This is a heartwarming movie with an extraordinary cast. This child actress (McKenna Grace) is fantastic. I feel she is much better than child star Dakota Fanning was at this age. I was impressed by the emotions displayed by this newcomer.  The story line is something we have all seen before; but the acting and the directors vision of the screenplay makes it a memorable film. It is well worth your theater dollars and time. A few cuss words; but only one F word if I recall correctly. This is a must see film for the insight of single parenting and foster homes. The effects on all concerned in trying circumstances is well addressed. I highly recommend this movie for an enjoyable night out.", "Gifted**** term is thrown around too often in 2017....  Brilliance without compassion & empathy is a vain pit... Heartfelt Touching portrayal of familial conflict is a stretch for Captain America , yet nicely obtained .   Newcomer McKenna Grace Is spot on, adding Octavia is frosting on a deluxe cake.  Savant or just ahead... What do we aspire to?  This movie is Worth attention & time!!!", "", ""]}
{"title": "Kong: Skull Island", "comments": ["A good old fashion monster movie", "Oh my ***! This movie is very suspenseful and action packed! It was so good that it made my nipples harden for half the movie! Hope they come out with a sequel!!", "This was a fun little journey with some flat characters, decent acting, amazing effects, and well executed action. Some jokes and suspense fall flat, but I still enjoyed it. The end credits scene was legitimately heart pounding.", "I am seeing Kong Skull Island in 3D on Saturday night and I am really excited. I am a huge fan of King Kong", "I was Crying all though the Movie, Y Did HE HAVE TO DIE???? MISS U KONG......"]}
{"title": "Everything, Everything", "comments": ["This movie is definitely made for the teeny boppers...A teenage boy falls in love with the girl in the bubble. Both kids have parent issues.  Both end up defying their folks and finding affirmation.  My 14 year old self would've loved this movie.  Most adults could probably live without it.  But the adult women seated around me at the screening seemed to love it, like they had been transported back to high school when they fantasized about some Romeo & Juliet scenario.  The story was pretty thin -- I spent most of the film just waiting for the girl to die.   But I found the performances appropriate for this genre.  And I thought the two kids had a nice chemistry.  Assessment  the movie version of a beach read", "The book version of this ,by Nicola Yoon, was amazing. It had so much detail, so I'm sure the movie will be just as good.", "I don't know about anyone else but the girls boobs were so huge! It actually took away from the plot of the movie.", "", "soooooo baaad really really really bad"]}
{"title": "Kiki’s Delivery Service – Studio Ghibli Fest 2017", "comments": []}
{"title": "Lowriders", "comments": ["Those movies about Mexican Americans living in the United States always have been saturated of clichs. One thing is how they have kept their culture other thing is how the Mexican Americans have adapted to the multicultural society in the United States, that last part never has been depicted in films.", "Anyone hoping to see some serious hydraulic action, will likely be disappointed. Low-riding takes a backseat here to man-whining, as the film’s main characters—a father and his two sons—petulantly jostle for dominance in a family melodrama so generic that it could unfold in just about any context. Far more creativity went into the various cars’ hood murals than into the screenplay. The hype was too high, I could of waited for it to come out on RedBox.", "Seems cliché.", "It was OK! But it really didnt show about why we build low riders and how Mexicans really are, or any of our heritage! Its a low budget film! It really could have been much better if they really tried.", "Worst movie ever.  Poor judgement in the title.  The acting was so poor and had nothing close to the title of the movie. Waste of $ to watch"]}
{"title": "Going in Style (2017)", "comments": ["It was great got lucky enough to go to an advanced screening. It was funny had a great cast and also had heart. I recommend to everyone!!", "Don't ever leave us. No one can bring with them the class and style of these guys and gals. I would have paid to see this cast sit around and drink coffee and talk about their lives. Movie had a timely story for older folks , that young people won't get. But it was great.", "While they might rob a bank, these three old dudes teach a few good morals and a hilarious way. Laughed whole time. A must see", "", ""]}
{"title": "Band Aid", "comments": ["This unfiltered, emotional, hilarious film should be mandatory for pre-marital counseling. Zoe Lister-Jones and Adam Pally are superb, but Fred Armisen steals the show as their strange neighbor/drummer. Treat yourself to this movie!", "This movie is so good! It is funny and also touching. It is an accurate portrayal of a marriage in a rough patch. It has enough humor to make it not a downer though. It's not specifically a 'chick flick' because it shows both sides of the relationship and how these two relate. I really loved it. The music is great as well. All characters are perfect. It's a 'slice of life' movie.", "I saw at a great theater but maybe wish I'd of waited to watch it at home.", ""]}
{"title": "DJ Duvvada Jagannadham", "comments": ["$30 for first day in Parsippany NJ. Total crap. These people trying to steal money from movie lovers.", "Zero star actor sucks", "Has funny moments, but the multiple killings (yes, of bad guys, but still . . .) by the hero, in a decidedly un-funny way, makes this quite un-comedic.  Movies are storytelling, and this one does a pretty good job of telling a fairly plot-twisted story.  The action scenes are well done, effects are, for the most part, unnoticeable. Subtitles are a real problem: they move too fast, and are very poorly translated to English - a native English speaker should have final edit on the subtitles.  Overall, a fun and entertaining movie.", "Worth it guys !", "Its pooja hedge's movie"]}
{"title": "Smurfs: The Lost Village", "comments": ["this is one of the best smurfs movie ive ever seen! loved it!!", "Really enjoyed movie and my kids want to see again!", "Loved it", "We loved the movie!!! ??", "Phenomenal children's movie."]}
{"title": "Diary of a Wimpy Kid: The Long Haul", "comments": ["Don't waste ur money the new rodrick looks like an Asian hipster and this movie is not funny basically no humor I would give this 0 stars. #oldcastback", "My 12yr old and my 7yr old loved this movie, my husband and I thought it was a great family movie, loved the fact that it had no obscene or crude jokes, we all enjoyed it! It was way too funny", "The books are wonderful and other movies in this series have been great. This however was horrible. Several people left after 30 min. We would have too if it wasn't my sons birthday and he's a huge fan of the books. But Alicia Silverstone was horrible and it was a bad script. Don't waste your time!", "Tuck this ho ***movie", ""]}
{"title": "King Arthur: Legend of the Sword", "comments": ["Went to the movie preview last night at the B and B in Wentzville. The movie was captivating. Well worth the tune and expense. I had never read the books and I am not a historian so I cannot validate whether the movie has authenticity to the legend. However, it does capture the imagination and keeps your interest throughout.  It starts out with the betrayal of Arthur's father by his brother for the crown. It shows the circumstances of Arthur's upbringing. It closes with his revenge on his uncle. This is a movie less of words than of action but there are still some poignant scenes to be had and some classic lines.  There is clearly much more to the story of King Arthur and this appears to be a first installment of a series.", "I loved it. Thought it was well down and Jacks is superb as is Jude Law. My favorite movie of the year. Critics pan it for not being historically accurate!! Are you kidding me? Highly recommend seeing this movie.", "I've seen this movie twice and enjoyed it both times, lots of action and humor. Don't linsten to these bad reviews these people are lame and probably wouldn't know a good action movie if it stabbed them in the chest with Excalibur!!", "Awesome Movie. The whole Pendragon/Arthur myth is woven in. Fight scenes are an homage to The Matrix. Jude Law is great at depicting Mega Evil. Charlie Hunnam is solid as the reluctant hero. I worried when I saw the Rotten Tomatoes score, but honestly, I really enjoyed this movie! Great scenery, swell costumes, terrific soundtrack, and trippy special effects. There is a moment or three of wooden dialogue, but overall it's zippy and often funny. Hunnam & Law are good in their roles and the posse of future knights is engaging, as is the actor who plays the Mage.", "Don't listen to the critics, they make me so mad, zero clue. Good action, solid story, would see again!"]}
{"title": "How to Be a Latin Lover", "comments": ["This movie was nonstop laughter. Definitely recommend for families. Really enjoyed it after a rough day, it made my night.", "", "So funny! This movie is hilarious! Eugenio Derbez is the funniest! And I loved that I can bring my family to it!", "Eugenio never fails to disappoint.", ""]}
{"title": "The Fate of the Furious", "comments": ["Wow! Funniest and best movie of the franchise so far hands down! Vin diesel looking like a DILF as usual", "Came into the movie being a huge fan of the originals, and didn't expect this one to be as good as some of my favorites, but wow... this was an amazing movie that had me feeling every type of emotion. It is now up there and arguably might be my favorite one so far. Worth seeing multiple times in the theater and that's what I'm gonna do. Looking. Ore forward now to 9 and  10", "We took our teenagers and went as a family. We loved this movie. I will always miss Paul Walker. However the entire cast did an awesome job as always, I felt the actors really bring you in. To much to say to little space. I would love to praise each of you for a great performance. Some highlights. The return of Jason Stathom added some great action. The addition of Scott Eastwood was interesting unexpected and occasionally funny. It wouldn't not hurt my feelings to see them  back in 9 ? I would say this movie is for 13 and up. Worth the trip to theater and as soon as DVD is out I will own a copy. Must see!!!", "I saw the screener last night, and F8 was an amazing movie. Great storyline, ALL THE ACTIONS, and a great ending in tribute to Brian/Paul Walker. It's arguably my favorite one so far. Can't wait for F9!", "First off it started with a lot of action and didn't stop . Loved it better then the last one . Major plot twist .. going to see it again . Tyrese is damn funny In this movie . Amazing cars."]}
{"title": "Alien: Covenant", "comments": ["Predictable, full of holes and two dimensional characters.  Saw the surprise ending a mile off and walked out with the wife at the end with a meh as my take away.  I'd wait for cable to show it.", ".A rouge unexplained solar flare hits the ship disabling it, and Walter says they should leave the area ASAP. Instead they go further into it.A damn astronaut outside the ship picks up a cryptic video message that goes straight to his helmet, yet the giant ship with with HUGE ***radio dish right next to him misses it.Okay so they all go down to the planet, with (Plasma Storms) all over the planet I mean all over the planet, NO SUN ANYWHERE ABOVE THE ATMOSPHERE, so they pilot the ship through a damn (Plasma ? ) and come out the storm and land in a near by lake and the sun ?? is shinning over the horizon, are you kidding meThey don't bother wearing space suits at all when they first land.OMG I keep going on with this mess of a movie because SERIOUSLY THERE IS A WHOLE LOOOOT MORE IN THIS MOVIE THAT WAS SOOO SOOO SOOO BAD, WITH OF COURSE THE PLOTS, ANDROIDS DOING STUFF THAT DEFINITELY COMES IN TO PLAY AND HAVE YOU SAYING REALLY, DUMBASS Ridiculous and unbelievable judgment calls.", "Not as bad as Alien 3 but despite some interesting moments in the film, it is altogether a disappointment considering it came from Ridley Scott.", "Honestly with the title containing Alien you would see more than you thought. But in the end it was a good film not spectacular could use more horror to it but overall good. Honestly go in to the movie with an open mind and create your own results.", "This movie was grosssss and Very satisfying to see the series going back to its roots definitely check this one out, full of gore action and suspense!"]}
{"title": "The Boss Baby", "comments": ["", "Better than expected. The story is original, funny and realistic; hopefully kids will learn something about loving and sharing with siblings. I love it", "Great animation, a funny story, it's fast paced, witty, and overall a fresh effort.  MM 1111", "Really cute and better than I expected! Hilarious too!", "This was a really good movie.  All the splash tomatoes from critics are ADULTS judging what kids would consider funny.  The message was good and if you have never been an only child then you don't get it.  Having a new baby come in with a twist to the plot and then the bond which grows was very entertaining and the imagination of the kid was great.  I like Alex Baldwin ( and for those who would never see anything, Alex Baldwin- well good because it was a CARTOON).  When did we as adults need to be entertained by a kids movie and then judge it ... jeez.  I loved it and my kid who has Autism liked it too ... Go see it ... don't let the tomato rating fool you ..."]}
{"title": "Baywatch", "comments": ["Official Baywatch Joe is going to See it. Early access May 24TH Selinsgrove Pennsylvania 700PM. When I was younger my family used to be part of the original Baywatch cast. They worked behind the screen with filming script writing and access the costume department and make up. I've also inherited a lot of Baywatch memorabilia through the years of my childhood and teenage years.  Last year on June 18 I lost my brother Colt Justice York would've been nice to see this BAYWATCH Movie with him, Amen Brother.  On my wish list this year for Christmas I want to pair of Baywatch 2017 shorts screen used Red and blue pattern design.", "The first 45 minutes are good. It the movie goes to hell after that. Cheap lines and weak plot, cheesy.", "", "Crude and horrendously bad.  Who viewed this movie and decided it was ready for release???? I don't even want my money back - I want an apology.  We walked out after an hour.", "Good actors cannot redeem grossly incompetent writing, directing and editing.  Felt like 5 hours of cringing at lame jokes and dialog.  Not a single clever line."]}
{"title": "Tubelight", "comments": ["One of the best performances by salman khan.. not typical slaman movie but i loved it.. full enjoyment...", "Wonderful and beautiful", "Amazing", "", "Whose fault is this movie? Salman?, Writer? Director? Editor?  More of Salman and Director but probably everyone. It wont hurt if Salman stops acting(?) better if he stops"]}
{"title": "Beauty and the Beast (2017)", "comments": ["I was enjoying the movie until the scene where Disney decided to endocrinate my children with the notion that being gay is a Disney way of life. It's okay to be gay. It's not okay for Disney to shove it down my children's throat.", "Originally Written March 17, 2017-- Belle (Emma Watson), a bright, beautiful and independent young woman, is taken prisoner by a beast (Dan Stevens) in its castle. Despite her fears, she befriends the castle's enchanted staff and learns to look beyond the beast's hideous exterior, allowing her to recognize the kind heart and soul of the true prince that hides on the inside.  So admittedly, my wife and I are huge fans of the original animated masterpiece that inspired this new live action version. As we attended a showing this evening, we truly hoped that we would enjoy it as much as we have loved the 1991 film. I'm ecstatic to say that this new version is fantastic! Everything we loved about the original film is in this one too, but without changing the overall story and the motivation of the main characters, this amazing remake gives more depth to the original story and lets the audience see more regarding what caused all of the characters to be where they are when the movie starts. Watson is stellar as Belle and Stevens is absolutely unbelievable as the Beast! I realize that the Academy Awards were just a few weeks ago, but if this film isn't at least nominated at next year's ceremony, it really will be a travesty. A tale as old as time is new and magical again! Two thumbs way, way up!", "Overall I really liked it. I'm a huge Beauty and the Beast fan, and have been since I was a kid, when the cartoon first came out, so I might've been a little biased on certain things, but there were some scenes that pertained to the whole LGBT that really did not have to be in there though.", "I sure didn't. But they did it! Belle has to be a tomboy (to work with her dad), tough (to stand up to Gaston) and able to wear the gown. Emma Watson hits the trifecta. I also loved the added depth of the characters. I'll be seeing this again..and again.", "Absolutely a beautiful remake of a great movie! Worth going to see. Disney never disappoints!"]}
{"title": "Paris Can Wait", "comments": ["A nice movie about nothing.  Lovely if you want a sedate evening about France and wonderful food.", "A great gastronomic  tour of France lots of architectural and painting references the theater was empty so I guess Americans don't want to see films with out super heroes or Pirates This is film all the family could see if they were planning a trip to France", "I can honestly say that this movie may not win any awards, but if you are looking for an entertaining story with beautiful French country scenery and a journey of gastronomical joy, you must see this. I really enjoyed it. Diane Lane did a believable job & while I am not familiar with Arnaud Viard, I was entertained by him.", "When the movie ended, me and someone near me said what? At the same time. We probably weren't the only ones who were thoroughly left hanging and confused.  Just terrible. No point to the story. No evolution of characters or plot.  It amazes me how a movie like this gets funded and how the writers and directors would ever get another job.", ""]}
{"title": "Megan Leavey", "comments": ["My wife picked this movie over a couple of the big summer blockbusters much to my chagrin.  Now that I am home I couldn't wait to comment.  The true story of Megan Leavey and Rex is time and money well spent.  I'll be posting on FB to tell all my friends to go to the movies and see this one!   Kate Mara is great as Megan Leavey.  You can feel the ups and downs of her emotions throughout the movie.     Do yourself a favor and see this flick.  You won't be sorry.", "If you love dogs and don't mind a few occasional tears, this is a great way to spend an evening enjoying a very good movie.  Megan Leavey is about the bonding of one of the few female Marine dog handlers and her overly aggressive, bomb sniffing German Shepard, Rex, during the first Iraq War.  In this true story, both Megan and Rex find respect and eventually love for one another which lasts until Rex's passing.  A dog lover's movie for sure.", "Really good movie, especially if you love military movies. Worth the watch", "Megan Leavy is one now one of my most favorite movies. The story, the actors, the action all fit together to draw you into the film.  Seeing it on the Big Screen truly enhances it.  Take friends with you because I am certain you will want to be talking about it after you leave the theater.", "Good movie and incredible true story, not that thrilling however great way to show animals mean a lot to some and should. Cried a lot!"]}
{"title": "Snatched (2017)", "comments": ["This is what passes as comedy in today's world? The same crude joke 9 different ways until it elicits a forced chuckle once so we can just move on? No thank you! Goldie was good, not her best but good to see her back on screen. The story is awful, plot nonexistent and feels more like a failed SNL sketch stretched out for a film. Amy Schumer is not funny. Stop trying to make it seem like she's funny. She's disgusting and can't decide which lane of comedy she wants to follow... 1: I'm a fat disgusting pig or 2: why don't men wanna bang this (gestures to self)   Not funny. Would not see again. Glad it was free, save your money.", "My friends and I (over 65) laughed until our cheeks hurt~the kind of belly laugh that lifts your mood and keeps you chuckling when recalling different scenes.  I'm proud of Goldie for getting out there and not pretending to be the sexy Grandma but rather a Mom to a rather dysfunctional (continual selfies) young woman who makes bad choices (who can relate to that?).   Writing comedy is a true talent...after all you must have a quick wit and that only comes naturally.  How many people do you know who are truly funny?   And Goldie actually resembles her younger self (with the help of fillers & hairdo) & pulls the lines off like an old pro.   Please find more comedy writers in Hollywood to keep our spirits up in this troubled world.", "It was a potato starring in a movie", "Amy Shumer is one of the worst comedians I've ever seen. Please dont see this movie. Garbage and I think you'll probably walk out", "Save your money folks"]}
{"title": "My Cousin Rachel", "comments": ["My wife and myself were attempting to find a movie without pirates, mummies, cartoons characters or space aliens and thought we would check out my cousin Rachel and much to our delight thoroughly enjoyed what we saw.", "Hi eqzhzgaxgii", "This flick  was one of the worst pieces of sophisticated  literary nonsense I have ever seen. Good acting but a story line written by  a five year old with a five year old imagination.  A  period  movie like this should tell a good story and have a little historical accuracy. In addition the sound track was terrible. I give it one and three eights  of a star.", "The acting was very good, the movie not so much.", "Classic redo of a Daphne Du Maurier  book  wonderful suspense kept you attention through out this movie I wish more films were made like this against studio type unfortunately in the US under appreciated and probably won't make big money at the  box office If you like costume drama with a superb cast and filming this is the best film this summer no Pirates or super heroes needed"]}
{"title": "The Hero (2017)", "comments": ["'The Hero' is a film, about finding mortality, flaws, heartbreak, love, and regrets. Elliot, however, delivers an Oscar worthy performance that you have to see this year.", "Sam Elliot is magnificent in this role of a lifetime. He says more in silence than many do while speaking.", "Worth the time to see a master at the top of his craft. Kristen Ritter is fine with several cliched moments and Laura Prepon is enough to make you believe her relationship. Be prepared for a lot of pot.", "I would go watch Sam Elliott cwash his dishes and love it. His voice is insanely sexy. I will go see it tomorrow and if the movie is no good it's the movie's fault. Just like Baywatch was a hit for obvious reasons, us ladies will flock to support Sam Elliott. It's all good Sam.", ""]}
{"title": "Captain Underpants: The First Epic Movie", "comments": ["Awsome movie", "The movie was okay. It had a few funny moments but the movie didn't go up to the potential that it's being promoted.", "It was so funny from start to finish", "Better than the book. Humor for all ages, young to old.", "My"]}
{"title": "Rough Night", "comments": ["Undoubtedly THE worst movie I've ever seen.  From weak story line to predictable characters to trying too hard to be something it's not, you'd be better off spending your money on a root canal...", "My guess is that they sold this movie to Scarlett Johansson first and the other female actors followed. How else could one explain this thing ever being made? Many have advised to wait and watch this on cable, I recommend cutting your cable first!", "All 4 funny scenes were shown on the trailors!  This movie as an epic fail.  This was a crossed between Weekend At Bernies, meets a WATERED-DOWN Bridesmaid!!  Was not worth my money!!!  Wait until it goes to Netflix!!!!", "??????? ???????", "", "Worst comedy I've ever seen"]}
{"title": "Guardians of the Galaxy Vol. 2", "comments": ["Originally Written May 4, 2017-- Peter Quill (Chris Pratt) and his fellow Guardians are hired by a powerful alien race, the Sovereign, to protect their precious batteries from invaders. When it is discovered that Rocket (voice of Bradley Cooper) has stolen the items they were sent to guard, the Sovereign dispatch their armada to search for vengeance. As the Guardians try to escape, the mystery of Peter's parentage is revealed.  You would think that after nine years and over a dozen movies that Marvel Studios would run out of ideas for its films. Or at the very least, they would make one that isn't amazing, incredible, and destined to gross a billion dollars. But it still hasn't happened! James Gunn, writer and director of the original 'Guardians of the Galaxy,' returns here for the fantastic and fun sequel. While there are ultimately lots of reasons why this film is so good, the inclusion of Baby Groot (voiced by Vin Diesel) is inspired because he absolutely steals the movie! Warner Bros. and DC Comics have nothing on their comic book counterparts. Congratulations Marvel on another blockbuster!", "THIS WAS THE BEST MCU MOVIE SO FAR OF THIS YEAR!!! ITS BETTER THAN THE 1st ONE!!!!!", "The writing and directing leaves a lot to be desired. Jokes are pretty bad, storyline pops up out of no where, and it is very slow. There never seems to truly be a villain and the movie just dragged on. Not enough real conflict to pull any heart strings. Weak movie that gets stars because the guardians themselves are cool. Groot is far and away the best part of the movie.", "Considering that I was a child, of the 80's, I can, honestly, say that [the Music of] GUARDIANS Of The GALAXY, Vol. 2 was a True Flashback, of Pure Nostalgia – having grown-up, listening to the likes, of FLEETWOOD MAC, and CHEAP TRICK!  The Movie Trailers are only the Opening Salvo, for what is [to date] The BEST DAMN MARVEL© MOVIE, YET!  Yep, STAN LEE has a Cameo!  Finally: take your hand, and Count the Number of Fingers, that You have, on that Hand, because that's How Many BONUS SCENES there are, in the End Credits!  I… Am… GROOT!!! [translated: Summer… Has… ARRIVED!!!]", "Saw the double feature and the two flow very well together. This outing we get more backstory on the characters that seemed to fall into the background on the first run. Yes.... there are a few too many one liners, and cameos are over the top, but this is a great Guardians movie. Drax and Rocket are forefront and Yondu has plenty of screen time (I'm Mary Poppins) and most of the unanswered questions are resolved. Overall, great movie and well worth seeing more than once."]}
{"title": "The Book of Henry", "comments": ["The trailer makes this film look like a unique, intriguing suspense-filled drama. However, be warned that this is a grossly misleading depiction of the film. In toto, the story I was expecting and wanting comprises only about the last half hour of the entire film. And even the way in which that act comes together is so implausible that it's very challenging, in spite of the great acting by the entire cast (which is the sole reason I gave two stars instead of the one star it actually deserves), to buy into the story. Embedded into the film is a completely unexpected -- not to mention totally unnecessary -- plot twist about which I had any inkling existed would have dissuaded me from seeing the film. My friend and I saw a Thursday evening screening before its official release today, and we, along with the other six viewers in our theater, were caught completely off guard by this already heavy story taking an even more depressing turn if there's a limit on watching the suffering of children, this movie exceeds it. And the amount of time that is spent focusing on this totally unadvertised plot twist and its aftermath is wrung out for every last morose micro-droplet. By the time I was actually watching the movie I had expected to see, I just wanted it to be over. But, no. Instead, thus begins the absurdity of a story so unbelievable that you can't help but be indignant that the writer and director think the audience so nitwitted as to believe that this is even a remotely conceivable scenario. Without revealing details there's a scene in which Naomi Watts runs across a bridge, in plain view of anyone who might be driving or walking by, toting an assault rifle half the length of her own body that actually made me laugh because of its farfetchedness. The two young male actors are terrific (the young female actor gives believable facial expressions, but has minimal dialogue), and the cast as a whole has palpable chemistry, but that big, and very BLEAK plot twist ruined it for me, my friend, and our fellow moviegoers based on our and their clear grumbling at the movie's end.", "We liked the book of Henry the south Florida herald and sun sentinel liked it too. Don't know why rotten tomatoes on fandango  disliked it so.. So much junk out there. Glad we didn't go by rotten tomatoes critics.", "What a great, touching sensitive and suspenseful movie. Some mature innuendos, so  suggest over 12 - 14 years of age, but no sex, nudity or violence, Will recommend this movie to all my friends. Critics are obviously clueless about what is entertaining.", "Despite what critics have said, this is actually a very good movie! The acting is superb! Naomi Watts and all of the child actors brought this film to life in a way that I think no one else could, and the expressions and dance by Maddie Ziegler made Christina's plight obvious and heartbreaking. You can see why her character finally moved the others in the film to try to help her. I do have a warning, however:  the story does take you on an emotional roller coaster, but it's done well. It didn't seem jarring to me at all, as some critics have claimed. Life, after all, has its sudden ups and downs. We need more movies like this in Hollywood.", "Loved every frame of the film. Characters were so awesome, writing, as always, entertaining in every way. I am a hardcore film fanatic and this was the most unique and satisfying film I've seen in so long. I will be emailing you with more detail shortly but my message to filmgoers who read the professional critics reviews when deciding whether or not to see something is this- they have it wrong so far.  This story is so refreshing. By the way- also one of the best teaser trailers I've seen executed. It gives NOTHING away and is that rare occasion where both the trailer and the film are A+. I could go on and on but the naysayers are likely already thinking this is one of those planted reviews. I can assure you it is not."]}
{"title": "Beatriz at Dinner", "comments": ["Trailer describe it as a comedy but it's in reality very dark and sad at the end . Amazing performances by all actors . Great dialogues . Some scenes leaves you with question mark, specially the ending ....", "This film is deep and wide.  Powerful, timely, and intimate on many levels.  This is about our earth, our people, greed, empathy, and loss.  None of it struck me as confusing.  Interpret the ending how you will, but the message for me was quite clear.  The tidal wave is overwhelming and people aren't paying attention or hearing the remedy.  We need relief.  Selma, writers and directors need a serious award for this.", "While the acting in this movie was good, the subject matter was politically based, and some scenes were quite disturbing. Left feeling depressed and emotionally drained. It's not that I expect to feel good when exiting a movie, but I certainly don't want to feel like every single character in the film should seek professional help immediately. Sorry. A waste of my $", "Waste of time and money.  Short film. The movie ends and you're left with the feeling of, that's it? Loose ends left untied. Don't bother. Hollywood at it's best throwing politics into a movie.", "SPOILER ALERT:  MT (Salma Hayek) w/ zero ethics, drinks excessively, smokes oncology client’s pot, shown pondering then killing her client’s friend/boss(?), then kills herself. Only in Hollywood."]}
{"title": "The Beguiled (2017)", "comments": ["I dont understand the people who say that this movie was horrible.  It was very good!   I loved the many scenes without background music, allowing only the morning sounds of birds chirping outside and the rustllng of the leaves, which allowed the audience to feel the underlying sexual tension in the house.  I think the the actresses did an excellent performance of gradually competing against each other for the attentions of a man in the house, especially an attractive man like Colin Farrell.  The movie gets five stars from me.", "Sofia Coppola thinks that a slow narrative and some foggy cinematography make a great intellectual movie . The Beguiled is just horrible , despite great acting performances from all the actors . Boring with random laughs , did not deliver. I can't believe she won best director at the Cannes Film Festival for this .", "The movie was amazing! It's gonna give you that HOLY OMG KINDA THING! Must watch you guys ! Totally worth !", "What could have been a remarkable movie became a lukewarm mess! Too bad so sad!", "If you saw the coming attractions then you know most of the movie's plot.  The photography does not have enough light.  Maybe this was meant to be artistic.  However, it's not artistic, it's just annoying."]}
{"title": "All Eyez on Me", "comments": ["So let's talk about this Tupac movie, I have to admit I might be a little bias about it because I'm a huge admire and fan of him. I was first introduced like really introduced and understood him by my mother at the age of 8 or 9, I mean of course I heard him on the radio before then but again I say really able to hear him, relate to what he was saying, appreciate his art by my mother.. So what that being said the man that played Tupac did a amazing job, now again this is my opinion, I think Demetrius Shipp Jr, did a excellent portrayer of Mr Shakur.. I love the breakdown they had while he was in Clinton Correctional Facility, the interview and the flashbacks were done good to me, especially how in depth they went in with him and his  mothers relationship, it was depicted very well. The lovely and beautiful Danai Gurira did well as Miss Afeni Shakur, she definitely capture her love, emotion and struggle well, you could definitely feel it.. I really enjoyed this film. ????????????????", "Tupac deserved so much better than this..they left out so much personal information as well as his relationships with his closest friends & family. I just felt like they focused too much on the biggie beef & his relationship with Jada which is information everyone already knew...The main thing that upset me the way they portrayed his mother Afeni..they made her out to be a crackhead he whole movie & not the BLACK QUEEN he referred to her as!!!! Point Blank waste of money. I felt like this would have been better off as a lifetime movie maybe then I wouldn't be so upset.", "Definitely a great film. You can't argue that. There were some parts that I felt that should've been added in like Pac's last words and/or the second shooting after Pac was shot. That's police files. And the shooting scene at the end in Vegas. Was a good scene. But the crash from Suge. And when they pulled Pac out the car. The song playing was off to me. I would've kept it silent. Sometimes you don't need music. The song was very benediction like when church is about to let out & you know that collection plate is coming around. But overall. The movie was good. It moved along well. Prior to watching it, k was wondering if some of his childhood scenes would feel like it's dragging. But it didn't at all. If anything. It was very fast paced. Pac was played well. It was good. But I do wonder why I'm Notorious they chose to show Big not present when Pac got off the elevator whereas in this film Big was upstairs looking at Pac with Big. I wonder why that scene has discrepancy in it self.", "", "Like PAC is the greatest rapper of all time  This movie is the Goat  It brought me back to 94 living in Cali"]}
